{
  "House" : {
    "Alabama" :     {
      "State:" : "Alabama",
      "Candidate:" : "Jesse T. Smith",
      "District:" : "5th",
      "Party:" : "Democrat",
      "About" : "Born June 1974 in Albany, Georgia, along with an older brother and a younger sister, Jesse’s grandparents raised him in Holly Holmes Public Housing in southwest Albany. He attended Westover High School, where, during his freshman and sophomore years, he was a member of The Patriots varsity basketball team and the band. The summer of 1992 presented an opportunity for him to escape the clutches of poverty and life in the projects. Prior to starting his junior year at WHS he moved to Washington D.C. to live with relatives. In 1993 he graduated as a junior from F.W. Ballou Senior High School in Washington D.C. Jesse, determined and ambitious, enlisted in the United States Army in March 1995. Upon completion of basic training he quickly deployed into action serving two tours in Bosnia supporting both Operations’ Joint Endeavor & Joint Guard. After successful completion of those assignments, he served back-to-back tours in Germany in conjunction with two combat tours in support of Operation Iraqi Freedom I and III, where he was among one of the first convoys to enter Tikrit Iraq prior to the capture of Saddam Hussein. He displayed exemplary leadership skills, which did not go unnoticed, and in March 2003 he was inducted into the Sergeant Audie Leon Murphy Leadership Club. This highly regarded achievement is only bestowed upon the top 2% of Enlisted Army leaders. Additionally, a nomination by his superiors resulted in his selection to attend the prestigious U.S. Army Sergeants Major Academy where he graduated from the Battle Staff Non-Commissioned Officers Course with superior ratings. On December 1, 2008, after serving nearly 14 years on active duty, he was honorably discharged from the military. He then chose a career path in which he continued to serve his nation as a federal civil service employee at the Department of the Army Combat Readiness/Safety Center. He served as an Accident Investigator (Fatality Division) & Tactical Occupational Safety & Health Manager for the Army Brigade Combat Teams. The tradition of service to the country is very evident in his family life as he is married to U.S. Army Captain Carla Smith and they are proud parents of 5 children: Darius, Jesse II, Latiffany Mykia (Specialist, U.S. Army), Jermonte (Petty Officer, U.S. Navy). While skillfully serving our nation in many capacities, his leadership traits have served him well and positions him to lead a Charge For Change in Washington D.C., representing Alabama’s 3rd Congressional District.",
      "Website:" : "http://www.jt4congressal03.com/"
    },
    "Arizona" :     {
      "State:" : "Arizona",
      "Candidate:" : "James Maloney",
      "District:" : "1st",
      "Party:" : "Democrat",
      "About" : "James Maloney is a native Arizonan and successful business owner with a proven record of building businesses and creating new jobs. Born in Tucson, James Maloney holds an MBA in Finance. After working for IBM, James went on to pursue his lifelong dream of owning his own business. James currently lives in Northeastern Arizona with his wife and three children. James is running for Congress because Arizona needs leaders who understand how to create jobs and strengthen small business. James Maloney will be a leader who has a strong focus on boosting the economy and the right experience needed to help Arizonans get higher paying jobs. James Maloney wants to take a real world business owner mindset to Washington D.C. and affect the changes Arizona deserves.",
      "Website:" : "http://www.maloney2016.com/"
    },
    "Arizona" :     {
      "State:" : "Arizona",
      "Candidate:" : "Raul Grijalva",
      "District:" : "3rd",
      "Party:" : "Democrat",
      "About" : "Raúl has a thirty-year record of exceptional public service in Southern Arizona. Raúl, his wife Ramona, and their three daughters, Adelita, Raquel and Marisa, have a lifelong commitment to improving the quality of life in the Southern Arizona community. In 2002, Raúl resigned from the Pima County Board of Supervisors to seek office in the newly created Seventh Congressional District. Volunteer efforts helped Raúl successfully overcome a nine-candidate primary against several former or then-current elected officials. Even as he was outspent three to one by his closest competitor, Raúl obtained a 20 point victory. Raúl won with a diverse coalition of supporters that led the largest volunteer-driven election effort in Arizona. Raúl’s campaign, “A Whole Lot of People for Grijalva,” was driven by volunteers who knocked on doors, made phone calls, handled mailings, and made great friends that expanded the Grijalva political family. That election united hundreds of wonderfully dedicated activists of all ages, races and interests. The 2002 election proved that volunteers and grassroots campaigning can win against money, connections and powerful interests. Since his initial election, Raúl has continued to aggressively campaign for reelection with the help of a whole lot of dedicated volunteers, whose numbers have continued to grow. These supporters stand together for Raúl because he has remained a steadfast leader who is unafraid to take tough votes. Raúl believes in educating the public rather than exploiting fears and insecurities. Since his election to Congress in 2002, Raúl remains committed to bring fairness and accountability to our federal government in providing services and protecting the health and safety of the public. Education, job creation, employee rights and the environment are some of his top policy concerns. As a member of the Committee on Education and The Workforce, Raúl helped to fund early childhood and preschool programs within our nation’s consistently underfunded education system. He successfully worked to improve funding to Migrant and Seasonal Head Start and to enhance outreach and services to Limited English Proficient children and their families. Raúl continues to improve the quality of life for working families by promoting minimum wage increases, supporting legislation to prevent intimidation, and pushing to help employees organize and represent themselves in the workplace. As a member of the Committee on Natural Resources, where he serves as Ranking Member of the National Parks, Forests and Public Lands Subcommittee, Raúl played the leading role in creating a permanent National Landscape Conservation System within the Department of the Interior and fought successfully to address the maintenance funding shortfall of American public lands. Recently, Raúl played a leading role in pushing the Obama Administration to protect 1 million acres of land in the Grand Canyon from the threat of expanded uranium mining. Long before the disastrous BP oil spill, Raúl pushed for effective oversight of the oil and gas drilling industries, and he continues to lead that charge. As Co-Chair of the Congressional Progressive Caucus (CPC), Raúl champions affordable health care for every American, and fights for job creation measures that focus on improving America’s infrastructure and economic base. As a long-standing member of the Congressional Hispanic Caucus — where he chairs the Education Task Force — Raúl continues to work for comprehensive immigration reform, standing up to those who want to exploit fear, insecurities and hatred to distract voters from the need to resolve common sense policy objectives. He has pushed for adequate funding for English language learners and fair access to quality education for minority communities.",
      "Website:" : "http://www.standwithraul.com/"
    },
    "Arizona" :     {
      "State:" : "Arizona",
      "Candidate:" : "Victoria Steele",
      "District:" : "2nd",
      "Party:" : "Democrat",
      "About" : "Victoria Steele is literally a coal miner’s daughter. Her father and grandfather worked in the coal mines of northwest Pennsylvania. She is of Native American (Seneca) and German ancestry. When her father’s health was threatened her mother went to work as a secretary to support a family of six on a meager wage. They didn’t have much money but she knew she was loved and Victoria’s parents instilled in her the values of hard work and service to community that are the foundation of her life. baby.jpg As a single working mom, Victoria struggled to make ends meet while putting her son through public school, working two jobs and going to college to earn a Masters degree in counseling. She eventually went into private practice and specialized in helping people heal from trauma, domestic violence and substance abuse. Prior to that, she enjoyed a 25-year career as a television and radio news broadcaster garnering numerous awards for her work. Victoria was elected in 2012 to the Arizona State House of Representatives from Legislative District 9 in Tucson. She has served as the Ranking Democrat on the Transportation Committee, and served as a member of the Health, Energy and Environment committees. She is strongly committed to Arizona’s economic recovery, job creation, and public education. In 2014 Victoria was re-elected to the Arizona State House of Representatives from Legislative District 9.",
      "Website:" : "www.victoriasteeleforcongress.com/"
    },
    "California" :     {
      "State:" : "California",
      "Candidate:" : "Preston Picus",
      "District:" : "12th",
      "Party:" : "Independent",
      "About" : "Preston has been a public high school teacher for the last nine years, having left a successful career in marketing in 2006 to work full time as a public servant. His interest in education began while working weekends and evenings at a group home for children in crisis. He has written three books: two works of fiction and his latest, a short book on campaign finance reform called Send Our Reps to Rehab. Preston works in economics, psychology, philosophy and physics and speaks on the necessity of improving the way humans do business. At the heart of his political efforts is this belief: as humans improve their technology and thus their capacity for consumption and violence, we must ensure that our systems and ideologies evolve to reflect our new capacities. To this end he lectures on the relationship between philosophy and physics, including a talk he delivered at UCLA in 2009. Preston is a Columbia University graduate, avid surfer, and a wrestling and football coach. In 2014 he married his wife Abbey and they are expecting their first child in October, 2015. After doing his duty as representative for California’s 12th district for no more than 8 years, Preston plans to spend the rest of his life as an educator in the Bay Area.",
      "Website:" : "http://www.picus2016.com/"
    },
    "California" :     {
      "State:" : "California",
      "Candidate:" : "Jared Hoffman",
      "District:" : "2nd",
      "Party:" : "Democrat",
      "About" : "Jared Huffman was elected in November, 2012 to represent California’s 2ndCongressional District which spans from the Golden Gate Bridge north to the Oregon border, and includes Marin, Sonoma, Mendocino, Humboldt, Trinity, and Del Norte Counties. Before his election to Congress, Huffman represented the North Bay for six years in the California Assembly, where he distinguished himself as a legislator who works hard and gets results, often forging bipartisan consensus on difficult issues. Huffman authored well over 60 pieces of successful legislation in the Assembly and received numerous awards for his legislative leadership. He chaired the Water, Parks and Wildlife Committee and played a leading role in crafting and passing landmark water reforms in 2009. Other notable laws authored by Huffman include California’s pioneering lighting efficiency standards (AB 1109) which were subsequently adopted into federal law; the nation’s largest programs for solar hot water heating (AB 1470) and paint recycling (AB 1343); reforms that improve California’s State Parks system (AB 1589) and Department of Fish and Wildlife (AB 2402); and creation of a new voluntary type of corporation, California Benefit Corporations, to promote corporate social responsibility (AB 361). Prior to his election to public office, Huffman was a Senior Attorney for the Natural Resources Defense Council (NRDC). One of his proudest accomplishments at NRDC was helping forge an agreement to restore a 153-mile stretch of the San Joaquin River in California’s Central Valley. Before he joined NRDC, Huffman was a successful public interest attorney whose victories included several major jury verdicts in gender discrimination and race discrimination trials. He also served 12 years in local government as a Director of the Marin Municipal Water District (MMWD), from 1994 to 2006. Huffman graduatedmagna cum laudefrom the University of California at Santa Barbara, where he was also a three-time NCAA All-American volleyball player. He went on to play for the USA Volleyball Team in 1987 when the team was ranked #1 in the world, before attending and graduatingcum laudefrom Boston College Law School. Huffman lives in San Rafael with his wife Susan, a teacher, and their two children Abby (13) and Nathan (10). In his free time, Huffman enjoys all types of fishing, as well as tennis and home winemaking. Huffman serves on the Natural Resources and Budget Committees in the 113thCongress.",
      "Website:" : "www.jaredhuffman.com/"
    },
    "Colorado" :     {
      "State:" : "Colorado",
      "Candidate:" : "Diane Degette",
      "District:" : "1st",
      "Party:" : "Democrat",
      "About" : "Chief Deputy Whip Diana DeGette is a 10th term member of Congress, representing Colorado’s 1st Congressional district. In her ten terms serving the Denver metro region, Diana has established herself as a leader for progressive change on health care, reproductive rights, food safety, consumer protection and the environment. Diana’s efforts have been recognized by Democratic leaders and pundits alike. In 2005, Diana was promoted to the House Democratic leadership as Chief Deputy Whip, a critical role in ensuring passage of key pieces of legislation. Citing her policy expertise and political savvy, National Journal named Diana a “Rising Star.” Diana serves on the powerful Committee on Energy and Commerce where she has used her position to improve health care, expand medical research, reform corporate business and accounting practices, ensure that our homeland is adequately protected, take on global climate change, and move America toward energy independence. In January, 2011, Rep. DeGette was elected the Ranking Member of the Subcommittee on Oversight and Investigations. A fourth-generation Coloradoan, Diana graduated from Denver’s South High School, received her B.A. magna cum laude from Colorado College in 1979 and her J.D. from New York University School of Law in 1982. She served two terms in the Colorado House of Representatives serving as Assistant Minority Leader from 1993-1995. Diana is married to attorney Lino Lipinsky. They have two daughters and a dog.",
      "Website:" : "http://degette.com/"
    },
    "Florida" :     {
      "State:" : "Florida",
      "Candidate:" : "Tim Canova",
      "District:" : "23rd",
      "Party:" : "Democrat",
      "About" : "Tim Canova has been challenging Wall Street banks and political corruption for most of his adult life. As an activist, attorney, educator, and frequent commentator on the rigged economic and political systems that put Wall Street and multinational corporations first while leaving ordinary Americans behind, Tim is uniquely positioned to shake up Congress. Born and raised on Long Island in Merrick, New York, Tim had strong family ties to South Florida before moving to the Sunshine State in the mid-1990s. He is from an immigrant half Italian Catholic, half Jewish family, which taught him the traditional values of honesty and hard work. Tim ran cross-country and track in high school and college, including on his high school varsity state championship cross-country team. As a teenager and young man, he worked in a wide variety of manual labor jobs, from delivering newspapers and cutting lawns to pumping gas, painting houses, loading trucks in a plastics factory, and picking avocados on a kibbutz in northern Israel. Tim attended public schools K-12, completed his undergraduate studies in government and economics at Franklin & Marshall College in Pennsylvania, earned a law degree, with honors, at the Georgetown University Law Center in Washington, D.C., and was a Swedish Institute Visiting Scholar at the University of Stockholm. As a legislative aide to the late U.S. Senator Paul Tsongas (Democrat, Massachusetts), Tim worked on a range of regulatory and human rights issues. While working on Capitol Hill, Tim began warning about the rise of Wall Street special interests and the assault on working families. In the early 1980s, he wrote critically about the deregulation of interest rates and lending standards and the rise of subprime and predatory lending. These practices would eventually have a devastating effect on the people of Florida when real estate markets crashed in 2008. To this day, Florida still has the highest rate of foreclosure in the country, with over 300,000 open foreclosure cases in state courts. In the 1990s, while an associate attorney at a prominent law firm and then as a visiting professor at the University of Miami, Tim opposed efforts to weaken the 1933 Glass-Steagall Act firewalls that had separated commercial banking from the risky securities markets. He also cautioned about the rise of complex derivative financial instruments that were turning the United States into a “casino” economy. In the early 2000s, Tim warned about the growing bubble in housing prices and called for increased supervision of Wall Street banks and financial markets. He was one of the few law professors in the country who consistently opposed Alan Greenspan as chairman of the Federal Reserve Board, including a 1996 op-ed in the New York Times opposing Greenspan’s reappointment. Tim left Miami for a tenure-track teaching position at the University of New Mexico School of Law, where he was granted early tenure in 2003. While in Albuquerque, Tim spearheaded a successful grassroots lobbying campaign to abolish the state’s felony disenfranchisement law that had barred about 6 percent of the state’s voting age population from voting for life, often for non-violent drug offenses. He argued the hypocrisy of locking people up – disproportionately minority and poor, and depriving them of their voting rights -- for using the same recreational drugs that were used at some point by successive U.S. presidents and about half of all Americans. Ever since, he has opposed the misguided “war on drugs” and the privatization of prisons that has resulted in the perverse incentive of warehousing people for profit. After New Mexico, Tim taught at Chapman University in Southern California, became an endowed professor in International Economic Law, and served as the academic associate dean, helping Chapman move up significantly in the national rankings. In his teaching and scholarly work, he emerged as a leading critic of the cozy relations between Washington and Wall Street that have corrupted our politics and distorted our economy. He opposed granting China permanent normal trade status and its entry into the World Trade Organization, was critical of the North American Free Trade Agreement and other corporate giveaways, and today is a fierce opponent of the proposed Trans-Pacific Partnership (TPP). In 2011, Tim took part in the Occupy Wall Street movement, teaching a workshop on the Federal Reserve at the Occupy Los Angeles encampment. At that time, he was also selected by U.S. Senator Bernie Sanders to serve on an advisory committee on Federal Reserve reform along with such leading economists as James Galbraith, Robert Reich, Jeffrey Sachs, and Nobel Laureate Joseph Stiglitz. During his time in New Mexico and California, Tim returned often to South Florida to visit with his many relatives, old friends and colleagues. On South Beach, he became known as “The Hurdler” for hurdling every garbage can – 572 in all – on the 8 mile Raven Run, and earned Run of the Year award two years in a row. He also visited Israel many times during this period, returning to his former kibbutz as a volunteer time and again, and participating in workshops on citizenship, war, and counter-terrorism at Tel Aviv University. Tim moved back to South Florida in 2012 for a teaching position at the Nova Southeastern University Shepard Broad College of Law where he is a professor of law and public finance. He lives in Hollywood, and in his spare time he enjoys cooking, movies, Pilates and yoga, as well as running and bicycling on the Hollywood Beach Broadwalk. Tim remains a leading critic of the Federal Reserve and Wall Street, opposes the corrupting influence of corporate money in politics, and is a strong advocate for programs to help students, working families, and lower- and middle-income folks. He will bring formidable energy, focus, experience, and integrity to Washington on your behalf, providing representation in the true sense of the word for the needs of the local constituents in South Florida’s 23rd Congressional District. Rather than doing the bidding of giant corporations like too many professional politicians these days, Tim asks you to join him to work for the interests of the actual, real people who reside here.",
      "Website:" : "https://timcanova.com/"
    },
    "Florida" :     {
      "State:" : "Florida",
      "Candidate:" : "Alina Valdes",
      "District:" : "25th",
      "Party:" : "Democrat",
      "About" : "Dr. Valdes is a Cuban-born immigrant having left Cuba as a young child with her family. She was raised and educated in the NYC area, where she received a BS in Chemistry with a concentration in Biochemistry from Herbert H. Lehman College of the City University of New York. Alina was accepted and completed her medical education at New York Medical College followed by a three-year residency in Internal Medicine at Lincoln Medical and Mental Health Center, a city hospital in the South Bronx. Upon completion of her residency, Dr. Alina Valdes remained at Lincoln Hospital where her ability to communicate directly with the large Latino population allowed her to serve the community well. She also held the titles of Assistant Professor at New York Medical College, giving her the additional responsibility of training all types of students and residents. Dr. Valdes then spent four years working as Attending Physician in Queens Hospital Center, another city hospital, in Jamaica, NY. Her passion and dedication to the underserved Latino Community of the South Bronx landed her a position at Morris Heights Health Center, a community-based facility providing comprehensive health services, from 1991-1999. As part of her duties, Dr. Valdes held various academic titles, including Clinical Preceptor and Clinical Adjunct of the Bronx Lebanon Physician Assistant and Medical Residency Programs, as well as Clinical Preceptor of the Harlem Hospital Physician Assistant Program. In addition, she served as Mentor to Lehman College Premedical students through the Montefiore Summer Outreach Program. Dr. Alina Valdes and students During her time at Morris Heights, Dr. Valdes served on various committees including the Advisory Committee for the Bronx Lebanon Physician Assistant Program, the Incentivization and Walk-In Committees for the Center, as well as Chairwoman of the Emergency Protocol Committee. Upon moving to Florida, Alina concentrated her efforts on her family but also found time to teach as Adjunct Professor at the Miami-Dade College Physician Assistant Program. In 2010, Dr. Valdes returned to her passion of caring for the underserved, this time providing health care to the homeless, mostly uninsured patients in Broward and Miami-Dade by working at the Miami Rescue Mission Clinics. She also resumed her love of teaching by becoming a Clinical Preceptor to medical, physician assistant, and nursing students at these health facilities. She is presently working at the Hollywood Outreach Health Clinic two days a week and holds active and unrestricted licenses to practice medicine in the state of Florida and the DEA. Dr. Valdes has been a member of the Broward County Medical Reserve Corp, a division of the State Emergency Responders and Volunteers of Florida (SERVFL) since April 2010 and has been ready to assist in any emergencies where medical personnel are needed. Though Alina has not held political office, she has been actively involved in many political causes and campaigns, having worked on the Obama for America 2012 re-election campaign as well as Charlie Crist for Governor 2014 and has served as an OFA Fall Fellow in 2013. Dr. Valdes is also a member of many Democratic political clubs and organizations, including serving as a co-lead for the NO KXL CREDO Pledge of Resistance Broward Action and as a Congressional District Coordinator for the National Committee to Preserve and Protect Social Security and Medicare. Dr. Alina Valdes’ life experience and unique set of skills has made her a champion of the working class and well suited to represent all residents of District 25 in Congress. Democrat For Congress.",
      "Website:" : "http://alinavaldesforcongress.com/"
    },
    "Illinois" :     {
      "State:" : "Illinois",
      "Candidate:" : "Marcus Lewis",
      "District:" : "2nd",
      "Party:" : "Democrat",
      "About" : "I was born to Anna & Martin Luther Lewis on December 27th, 1958 at Provident Hospital in Chicago. I grew up in a loving single parent home because my father had fallen off a step-ladder hanging drapes he had made for the dining room. My dad was paralyzed from the neck down. The doctors found he had cancer as well. He lived for three weeks and passed away in July of 1959. I and my twin brother, Martin, were only 7 months old. My mother carried on with the help of her mother to raise us, never marrying again. I told my beloved late mother in 1983, after participating in Harold Washington's Successful Mayoral Campaign Victory, \"Momma, what if I ran for Congress?\" And before I could finish the word 'Congress' she said, \"I'll walk the streets for you to help you get elected\". I have lived a working man's life, but opportunities were available, not like in today's economy. My first job at age 14 paid $1.65 an hour. I was cutting weeds in vacant lots for Mayor Daley's Summer Youth Program. By the way, it was federally funded and was hard work but rewarding, and I gained experience because I took pride in knowing it had to be done and I earned my way. In 1977, I graduated from De La Salle Institute (High School), and upon graduation, I earned a select spot to become a \"First Intern\" at 1st National Bank of Chicago (Now called Chase). This was a federally funded program to assist young people's entry into the area of corporate banking. This is where I learned about banking, and received a scholarship to become a manager after graduation from DePaul University where I majored in Business Management and Banking. After 2 years, my career interests changed and I left both DePaul and 1st National. I was employed as a Hotel House Cleaning Supervisor at the Hyatt Regency Chicago. Next I was employed as a proxy for an investment firm. Also I was a Baggage Handler for American Airlines for 5 ½ years (1984 to 1989), where I invented the now widely used 'Baggage Canvas Tractor Door' which saved airlines millions in vital replacement and repair costs. I was a 4th generation farmer in Munfordville, Kentucky. Our 44 acre farm was in the family since March 15, 1932 until December 7, 2007. I understand trying to hold on to precious land when outsiders use pressure tactics to swipe it out from you. In 1999, I was ordained a minister in the Apostolic faith. For almost 17 years I was employed at the United States Postal Service in Carol Stream, Illinois as a Mail Handler repairing mail in the Nixie \"WE CARE\" Unit. I was discharged from the Postal Service on May 16th, 2014 because I chose to run for Congress. I want every child to have an equal opportunity for a quality education, a good job, and a bright future.",
      "Website:" : "http://www.marcuslewisforcongress.org/home.html"
    },
    "Iowa" :     {
      "State:" : "Iowa",
      "Candidate:" : "Gary Kroeger",
      "District:" : "1st",
      "Party:" : "Democrat",
      "About" : "I was born and raised in Waterloo and Cedar Falls, where my father worked as an engineer for John Deere and my mother was a special education teacher in the public schools. My parents were members of a proud middle class who instilled their three sons with the values of hard work, the importance of a good education and a moral obligation to support equal rights and compassion for all.  With a scholarship, affordable loans and an early morning job washing dishes, I was fortunate to attend and graduate from Northwestern University. We now live in a time where those values may seem marginalized as opportunities for hard-working middle class families have been pushed aside by unfair policies that favor profits over people and the more privileged over those who are struggling just to get by. As someone who truly treasures the life I have in Iowa, I realize I have responsibility to do something about this. I was extremely fortunate to grow up during a time where my parents could raise three sons in comfortable circumstances and send us to colleges of our choices. I want my sons and all the children of Iowa to have those same opportunities. It is what makes this country strong, inclusive and exceptional. We should never give up on the dream of leaving a better world for our children.",
      "Website:" : "http://www.kroegerforcongress.com/"
    },
    "Kentucky" :     {
      "State:" : "Kentucky",
      "Candidate:" : "Geoff Young",
      "District:" : "6th",
      "Party:" : "Democrat",
      "About" : "",
      "Website:" : "cant find one"
    },
    "Maine" :     {
      "State:" : "Maine",
      "Candidate:" : "Joe Baldacci",
      "District:" : "2nd",
      "Party:" : "Democrat",
      "About" : "dropped out of race",
      "Website:" : "https://www.baldacci2016.com/"
    },
    "Maryland" :     {
      "State:" : "Maryland",
      "Candidate:" : "Terence Strait",
      "District:" : "4th",
      "Party:" : "Democrat",
      "About" : "Many people in our district and around the country have given up on politics as hopelessly corrupt. With politicians raising millions of dollars each election cycle, regular people don't believe their elected representatives are representing anybody but their wealthy donors. There is a sense of helplessness, and you hear it all the time in claims that both parties are the same, and have sold out to corporate interests. You can see it every election in voter turnout rates. Even in 2008, when there was such a wave of excitement surrounding the Obama campaign, only 62% of eligible voters actually showed up. In 2014, that number dropped to just over 36%. For a long time, I thought that as long as I was voting, I was doing my part. I have not been immune to the disillusionment that many other people face, but kept showing up. Recently, I have come to the conclusion that voting was no longer enough for me. Between the government shutdown, repeated last minute battles over the budget and debt limit, and complete lack of planning for the future, I decided it was time to step up and get involved. I do not buy into the rhetoric that both parties are the same. Democrats have done important work in preventing a rollback to the social policies of the 1950s and the economic policies of the 1920s. However, maintaining the status quo is not enough. Facing a looming climate crisis, crumbling infrastructure, and the twin threats to employment of automation and outsourcing, we have to make an active effort to plot a course into the future. I believe that I can contribute to that effort, and I hope you will join me. Please sign up for updates, volunteer, or contribute and be a part of this movement. Let us work together to build a world worth handing down to future generations.",
      "Website:" : "http://www.straitforcongress.com/"
    },
    "Michigan" :     {
      "State:" : "Michigan",
      "Candidate:" : "Debbie Dingell",
      "District:" : "12th",
      "Party:" : "Democrat",
      "About" : "Debbie Dingell is President of D2 Strategies and chair of the Wayne State University (WSU) Board of Governors, to which she was elected statewide in 2006. An active civic and community leader, she is a recognized national advocate for women and children. Debbie is immediate past chair of the Manufacturing Initiative at the American Automotive Policy Council. For more than 30 years she served one of Michigan’s largest employers, the General Motors (GM) Corporation, where she was President of the GM Foundation and a senior executive responsible for public affairs. In her commitment to job creation, Debbie recently led the effort to bring the 10,000 Small Businesses initiative, a $20 million partnership designed to help create jobs and economic growth, to southeast Michigan. With values instilled by her Catholic education, Debbie’s activism took root in her passion for issues important to women and children. She successfully fought to have women included in federally-funded health research, and advocated for greater awareness of issues directly related to women’s health, including breast cancer and women’s heart health. She is a founder and past chair of the National Women’s Health Resource Center and the Children’s Inn at the National Institutes of Health (NIH). She has served on numerous boards related to women’s issues including the advisory boards for the NIH Panel for Women’s Research, the Michigan Women’s Economic Club, the Susan B. Komen Foundation, and the board of the Michigan Women’s Foundation. She was a co-founder of both the first Race for the Cures in Michigan and in Washington, D.C. Debbie leads a number of efforts and initiatives related to young people and education stemming from her role as a WSU Governor and co-chair of the Children’s Leadership Council, a business-led advocacy group that promotes investment in early childhood education. She chaired the Michigan Infant Mortality Task Force, the Baby Your Baby public education campaign that reduced infant mortality rates in Michigan, and has served on the board of Michigan’s Children, the only statewide independent voice working to ensure that public policies are made in the best interest of children from cradle to career. She was appointed by Michigan Governor Jennifer Granholm to serve on the Early Childhood Investment Corporation and the Cherry Commission on Higher Education and Economic Growth. Debbie is a member of the Democratic National Committee and has chaired numerous political campaigns. Much of her recent work has been focused on ethical issues and social responsibility as they relate to government and business. She co-chaired One United Michigan, which sought to preserve and support programs that ensure equal opportunity in Michigan. She chairs the Metropolitan Affairs Coalition, a statewide organization that brings business, labor and government together to find commonality on issues. She continues to serve on the Parade Company board of directors of which she is past chair, where she helped save America’s Thanksgiving Parade, an important Detroit tradition. A known “bridge-builder,” she continues to promote and lead efforts toward greater understanding among people of differing points of views and backgrounds. Debbie is a respected voice in Michigan. She co-hosted Detroit Public Television’s “Am I Right,” regularly served as a panelist on “Flashpoint,” a public affairs program on WDIV-TV4 Detroit, and was named one of the 100 Most Influential Women in Michigan by Crain’s Detroit Business. Debbie resides in Dearborn with her husband Congressman John D. Dingell of Michigan. She holds both a B.S.F.S. in Foreign Services and an M.S. in Liberal Studies from Georgetown University.",
      "Website:" : "debbiedingellforcongress.com/"
    },
    "Michigan" :     {
      "State:" : "Michigan",
      "Candidate:" : "John Conyers Jr.",
      "District:" : "13th",
      "Party:" : "Democrat",
      "About" : "United States Congressman John Conyers, Jr., a Democrat from Detroit, was re-elected in November 2012 to his twenty-fifth term in the U. S. House of Representatives, winning 83 percent of the vote in Michigan's Thirteenth Congressional District. Congressman Conyers represents parts of metropolitan Detroit and Dearborn Heights, all of Inkster, Highland Park, Garden City, Redford Township, Wayne, and Westland. In addition, Congressman Conyers represents the Down River communities of Ecorse, Melvindale, River Rouge, and Romulus. Congressman Conyers, a senior statesman in American political life, is respected and admired by colleagues on both sides of the aisle. Throughout his years of public service, Representative has built a lengthy record of legislative achievement on Capitol Hill in his quest for “Jobs, Justice and Peace.” Currently, Representative Conyers is currently the Ranking Member of the House Judiciary Committee, the Dean of the Congressional Black Caucus, and the second-most senior member of the House. Previously, Congressman Conyers was the Chairman of the House Committee on Government Operations - now called Oversight and Government Reform - and served as chairman of the House Judiciary Committee. If re-elected, Congressman Conyers will become the longest serving Member of the U.S. House of Representatives, becoming the first African American Dean of the House in history. Serving the People of Michigan's 13th District Congressman Conyers is a tireless advocate for the people of Michigan's 13th Congressional District. In his decades of public service, Congressman Conyers has always fought for Michigan’s working families and defended the least fortunate. With workers’ wages stagnating and unemployment that remains stubbornly high, Representative Conyers continues to fight for equal pay, an extension in jobless aid as well as an increase in the minimum wage, and full employment for all Americans. He has been a fierce opponent of House Republicans’ attempts to roll back workers’ rights, eliminate safety standards, and shred the social safety net. Personal and Family History Congressman John Conyers, Jr. was born and raised in Detroit, where he attended the City's public schools. He served in the National Guard and the Army Corps of Engineers during the Korean War and then returned to Michigan to earn his bachelor's and law degrees from Wayne State University. Congressman Conyers was active in the Civil Rights Movement, during which time he worked closely with Reverend Martin Luther King, Jr., Rosa Parks, and many others who would become his colleagues and lifelong friends. Representative Conyers is married to Monica Esters Conyers. Together, they have raised two sons, John III and Carl Edward.",
      "Website:" : "www.johnconyers.com/"
    },
    "Michigan" :     {
      "State:" : "Michigan",
      "Candidate:" : "Brenda Lawrence",
      "District:" : "14th",
      "Party:" : "Democrat",
      "About" : "Brenda Lawrence has lived in this district her entire life. She was born and raised in Detroit, graduated from Pershing High School, married her high school sweetheart, bought her first home on Detroit’s east side, sent her children to Detroit Public Schools, worshiped here, worked here, and served in public office here. In 2001, Lawrence became the first female and first African-American Mayor of Southfield. She was resoundingly re-elected three times and has served for over 12 years in the city of 72,000 residents. Under her leadership, Southfield has remained economically strong. From income to race to educational attainment, the district is highly diverse. As Mayor of Southfield, Lawrence has a history of being inclusive and ensuring all voices are heard. Lawrence is President of the National Association of Democratic Mayors. She was the Democratic Lieutenant Governor nominee in 2010 and was the first African-American female major party nominee for that position in Michigan’s history.",
      "Website:" : "brendalawrence.com/"
    },
    "Minnesota" :     {
      "State:" : "Minnesota",
      "Candidate:" : "Rick Nolan",
      "District:" : "8th",
      "Party:" : "Democrat",
      "About" : "Rick is a father and grandfather, married to Mary Nolan for 30 years, and born and raised on the Cuyuna Iron Range in Minnesota’s 8th District. He is successful small-business owner who created jobs throughout northern Minnesota from the sawmill and pallet factory he owned in Emily. Rick is a lifelong hunter and fisherman, who harvests wild rice in the fall, boils maple syrup in spring, and never misses a fishing opener. In Congress, Rick has fought to: Expand the middle class by: Raising the national minimum wage to a wage people can live on; Supporting Minnesotan mining by enabling critical projects on the Iron Range to move forward – and making sure they adhere to our nation’s strictest environmental and safety standards; Promoting northern Minnesota’s timber industry and the jobs it supports with an amendment to the Farm Bill encouraging the use of forest products as environmentally friendly building material; Stamping “Made in America” on all U.S. pipelines. Rick has introduced legislation to require that pipelines built in the United States use iron ore that is mined, processed, or reprocessed in America. Protect Social Security & Medicare, opposing any attempt to privatize it or hand it over to private insurance companies. Defend and expand veterans benefits by voting to double funding at the VA to do away with the notorious backlog in claims processing; expand access to health care for vets who live in rural areas; and broaden the type of care veterans can receive (to services like chiropractic care and treatment for PTSD and Agent Orange). End wars of choice in foreign nations like Syria, Afghanistan, and Iraq. Rick’s measure to stop wasting taxpayer dollars on unnecessary Afghanistan construction projects was passed by the House of Representatives in a recent Defense bill, and his advocacy was featured in TIME Magazine. Put a stop to government waste by advocating for the elimination of a redundant USDA inspection program that costs taxpayers $170 million a year. Rick also introduced a bill during the government shutdown in October 2013 to prevent Members of Congress from getting paid while the government wasn’t operating. Protect our lakes, rivers, and streams, as well as tourism and fishing jobs with his amendment in the Water Resources bill preventing the spread of invasive species like Asian carp and zebra mussels.",
      "Website:" : "http://www.nolanforcongress.org/"
    },
    "Minnesota" :     {
      "State:" : "Minnesota",
      "Candidate:" : "Betty McCullom",
      "District:" : "4th",
      "Party:" : "Democrat",
      "About" : "Betty McCollum is a member of Democratic Farmer Labor Party (DFL) serving her seventh term in Congress representing Minnesota's Fourth Congressional District. With her first election in 2000, Rep. McCollum made history as only the second woman elected to serve in Congress from Minnesota since statehood in 1858. In 2012, Congresswoman McCollum was re-elected with 62% of the vote. In the U.S. House, McCollum is a member of the powerful Appropriations Committee serving on the Subcommittee on Defense and the Subcommittee on the Interior and Environment. Congressional Quarterly’s Politics in America: 2014 profiles McCollum, stating: “Pleasant, partisan and liberal, McCollum stands up for the priorities of President Barack Obama from her post on the Appropriations Committee.” Rep. McCollum has a reputation in Congress as an outspoken voice for economic opportunity, social justice, and fiscal responsibility while championing a progressive agenda for working families, seniors, women, and children. At home in Minnesota, Betty is working to improve our environment, promote excellence in public education, provide quality, affordable health care, and ensure investments in transportation infrastructure to keep our Twin Cities and East metro economy strong and growing. And, with more than twenty higher education institutions in the Fourth District, Betty is committed to keeping tuition affordable for students and families. In Congress, Betty is a champion for workers rights, tribal sovereignty for Native Americans, full civil rights for LGBT Americans, protecting Medicare and Social Security, and ensuring all women can access affordable, quality reproductive health care without government interference. A strong supporter of safe and strong communities, McCollum supports federal investments for our first responders and ensuring that America’s infrastructure is world class. She supports sensible gun violence prevention legislation which has earned her an “F” rating from the National Rifle Association (NRA). Betty strongly supports a robust U.S. global leadership role in advancing international development, global health and human rights. In the 113th Congress she helped pass legislation to protect young girls from forced marriages in developing countries and is the author of the bipartisan Global Food Security Act to combat hunger. During her career she has championed maternal and child health, poverty alleviation, HIV prevention and treatment efforts, and rights for women and girls. Congresswoman McCollum is a Senior Democratic Whip and is the Democratic co-chair of the Congressional Native American Caucus. She is the founder and co-chair of the Congressional Global Health Caucus. McCollum also serves as House Democratic Leader Nancy Pelosi’s appointment to the National Council on the Arts and characterized as a “strong supporter of public investment in artists, arts organizations, and arts education to strengthen communities and foster economic development.” McCollum was elected and served on the North St. Paul City Council from 1987 to 1992. She went on to serve four terms, from 1993 to 2000, in the Minnesota House of Representatives. Betty grew up in South St. Paul, MN. She raised her children in North St. Paul and now she resides in St. Paul. A graduate of St. Catherine University, Betty has worked as a high school social science teacher and in retail sales and management for twenty-five years. Betty is the mother of two adult children, Sean and Katie.",
      "Website:" : "www.mccollumforcongress.com/"
    },
    "Minnesota" :     {
      "State:" : "Minnesota",
      "Candidate:" : "Angie Craig",
      "District:" : "2nd",
      "Party:" : "Democrat",
      "About" : "Growing up in a trailer park, Angie Craig didn’t expect to end up as an executive at a Fortune 500 company, or running for Congress, but her life experience did teach her that hard work and a good education could lead to a better life. Angie watched as her mother raised three kids, all while working and going to school. It took ten years, but Angie’s mom never gave up; she earned her college degree and became a public school teacher. With that kind of example, it’s no surprise that Angie, her brother and sister were expected to go to college, no matter the obstacles. By working two jobs, and with help from student loans and her father, Angie graduated from the University of Memphis. Since then, Angie Craig has been a journalist and risen through the ranks at two companies, including St. Paul based Fortune 500 healthcare company, St. Jude Medical. Over the past decade at St. Jude Medical, Angie’s responsibilities have included health policy, media relations, corporate communications, and government relations. She led the company’s Global Human Resources group over the past four years, where she helped create jobs in Minnesota and build a program that led to more women in management. Angie Craig is running for Congress to make sure that all families have a path to create a success story like her family achieved. From high quality public education and affordable college to creating meaningful, good paying jobs, Angie Craig knows what it will take to restore the American Dream for the next generation. Angie and her wife Cheryl Greene live in Eagan. Cheryl taught middle school for over 20 years and now trains teachers and administrators on how to prevent bullying and create safe and welcoming schools for all students. Angie and Cheryl have four boys, Josh, 18, Jonas, 18, Jacob, 17 and Isaac, 13. In addition to working and helping to raise four boys, Angie has been actively involved in the Twin Cities community over the past decade. She is a member of the Eagan Rotary and board member of Open Arms of Minnesota. She served as precinct chair in Senate District 51 for the Democratic-Farmer Labor Party (DFL), and previously served on the boards of womenwinning, the St. Paul Area Chamber of Commerce, Life Science Alley and the Twin Cities American Heart Association (AHA). She also served as chairwoman of the Twin Cities Go Red campaign and the Advancing Sciences Breakfast for the AHA.",
      "Website:" : "www.angiecraig.com/"
    },
    "Minnesota" :     {
      "State:" : "Minnesota",
      "Candidate:" : "Gwen Moore",
      "District:" : "4th",
      "Party:" : "Democrat",
      "About" : "The first African-American woman in Wisconsin history to serve in the U.S. House of Representatives, Congresswoman Gwen Moore took her official oath of office on January 4, 2005. In January of 2011, Congresswoman Moore was elected Democratic Co-Chair of the Congressional Women’s Caucus by her fellow female colleagues. In this capacity, she has become a leader on issues like health insurance reform, women’s health, domestic violence and maternal and infant mortality – problems that affect women both at home and abroad. She served as Democratic Vice Chair from 2009 to 2011. In her committee work, Congresswoman Moore is a member of the prestigious House Committee on Financial Services, which has jurisdiction over the banking, insurance and housing industries. She serves on two subcommittees of the House Committee on Financial Services, including the Subcommittee on Capital Markets and Government Sponsored Enterprises and the International Monetary Policy and Trade Subcommittee. Rep. Moore also sits on the House Budget Committee, which oversees the federal budget process, reviews all bills and resolutions on the budget, and monitors agencies and programs funded from the budget process. She is also a member of the Democratic Steering and Policy Committee. Congresswoman Moore is a strong advocate for measures that focus on improving the economic and employment conditions in low-income communities. She has fought to curb predatory lending in minority neighborhoods, supported sound efforts to help small businesses grow and advance the creation of new jobs, pushed for more affordable housing, and advocated for compliance with respect to the non-discriminatory hiring of minority-owned businesses for government contracts. She has been an ardent supporter of initiatives that put low-income students on the path to educational success. She has consistently supported legislation to ensure low-income students have school access to three nutritious meals a day, year-round, as good nutrition has been proven to improve children’s attendance and attentiveness. Congresswoman Moore has also advocated for Federal TRIO programs, which are designed to support students from disadvantaged backgrounds and help them get to college. TRIO includes six outreach and support programs targeted to serve and assist low-income, first generation college students — and students with disabilities — to progress through the academic pipeline from middle school to post baccalaureate programs. When it comes to our troops, Representative Moore has been a strong advocate for boosting the efforts of the U.S. Department of Defense and Veterans Affairs Department to ensure our nation’s service members and veterans get the care they need to successfully address Post Traumatic Stress Disorder (PTSD). In order to combat the stigmas associated with PTSD, Congresswoman Moore has introduced legislation to promote confidential mental health care services for members of the military. She has also supported increased funding for PTSD research and treatment programs. With her colleagues, Congresswoman Moore has led efforts urging the Army to help reduce the perception that seeking mental health counseling will negatively impact a person’s military career and promotion prospects. Born in Racine, Wisconsin in 1951, Congresswoman Moore was raised in Milwaukee. The eighth of nine children, Rep. Moore’s father was a factory worker and her mother was a public school teacher. Congresswoman Moore attended North Division High School in Milwaukee where she served as Student Council President. After graduation, Rep. Moore started college at Milwaukee’s Marquette University as a single, expectant mother on welfare who could only complete her education with the help of TRIO. Congresswoman Moore earned a B.A. in Political Science from Marquette, and went on to serve as a community leader, spearheading the start-up of a community credit union as a VISTA volunteer for which she earned the national “VISTA Volunteer of the Decade” award from 1976-1986. She served in the Wisconsin State Senate from 1993-2004. Prior to her election to the Senate, Congresswoman Moore served two consecutive terms in the Wisconsin State Assembly from 1989-92. In 2000, Congresswoman Moore earned a Harvard University Certificate for Senior Executives in State and Local Government. As a state legislator, Congresswoman Moore was a champion of progressive and social issues and has continued to stand up as a voice for each and every constituent and neighborhood across the city. She applied her career expertise to help create jobs and build communities. She made a positive impact in critical issues related to welfare, education and criminal justice. A tireless advocate of women’s rights and civil rights, Congresswoman Moore led the fight against racial profiling, domestic abuse and voting rights violations.",
      "Website:" : "www.gwenmooreforcongress.com/"
    },
    "Minnnesota" :     {
      "State:" : "Minnnesota",
      "Candidate:" : "Keith Ellison",
      "District:" : "5th",
      "Party:" : "Democrat",
      "About" : "Congressman Keith Ellison has represented Minnesota’s Fifth Congressional District in the United States House of Representatives since taking office on January 4, 2007. His policy agenda is based on four key priorities—peace, prosperity for working families, environmental sustainability, and support for civil and human rights. He is currently serving his fourth term. The Fifth Congressional District encompasses the city of Minneapolis as well as surrounding suburbs including St. Louis Park, Richfield, Golden Valley, Columbia Heights, New Hope, Crystal, Robbinsdale, Fridley, St. Anthony, Spring Lake Park, Hilltop, Fort Snelling, Hopkins, Brooklyn Center, and portions of Edina. It is known as the most vibrant and ethnically diverse District in Minnesota. Keith is one of Congress’ foremost progressive leaders. He is the Co-Chair of the Congressional Progressive Caucus, a position he has held since 2011. He has consistently fought for job creation, progressive tax rates, health care for all, workers’ rights, a clean environment, quality education, fair trade, strong consumer protections, protecting the right to vote, equality and justice for all, and greater investment in infrastructure. Keith is committed to strengthening our neighborhoods through community organization and advocacy. His entire adult life has been spent bringing communities together, particularly helping give a voice to communities who might not otherwise be heard. His philosophy is one of generosity and inclusion – because there are enough resources in our communities for everyone to prosper. Born and raised in Detroit, Congressman Ellison graduated from Wayne State University in 1986 with a Bachelor of Arts in Economics. He moved to Minnesota in 1987 to attend the University of Minnesota Law School where he earned his law degree in 1990. Keith currently lives in North Minneapolis. Upon completion of his Juris Doctor, Congressman Ellison practiced law from 1990 to 2006 in both the private sector and as executive director of the Legal Rights Center. In 2004, he was elected to the state legislature from District 58B in North Minneapolis. He became a strong advocate to protect Minnesota children from dangerous pesticides and chemicals, promoted legislation to restore the voting rights of ex-offenders, and successfully advocated for an increase to the state’s minimum wage. When long-serving Fifth District Congressman Martin Sabo announced his retirement after 28 years in Congress, Keith jumped into the race. He quickly established himself as a formidable candidate by winning a first ballot Democratic-Farmer-Labor Party endorsement in a multi-candidate field of former and current office holders. Keith was challenged in the DFL primary by six candidates, and won by ten percentage points. He went on to win the general election with 56% of the vote in a four-way race. Since Keith’s first election in 2006, his campaign has focused on engaging current voters, while also working to expand the number of voters above the previous election cycle. This effort has caused a dramatic turnaround in voter participation in the 5th Congressional District, which led Minnesota in voter turnout in 2012.",
      "Website:" : "http://www.keithellison.org/"
    },
    "Missouri" :     {
      "State:" : "Missouri",
      "Candidate:" : "Jim White",
      "District:" : "4th",
      "Party:" : "Democrat",
      "About" : "I want to be your congressman, so that I can be the voice of the regular people of Missouri’s 4th district. I retired in 2010 after 35 years in the investment business. It was in that business I learned the importance of taking care of and investing in your assets. As a nation the most valuable asset we have is our citizens. I will do my very best to insure the well-being of our citizens. To begin with, everyone regardless of wealth or income should have access to health care. We can’t claim to have the best health care system in the world when so many of our citizens, our assets, are not able to use it. No one should face medical bankruptcy. Next, we need to insure that everyone who works earns a living wage. Too many minimum wage workers are unable to afford the very basics for their family. The minimum wage needs to be raised so that no minimum wage worker, working full time, needs to apply for food stamps or public assistance. One of the best investments we can make in our assets (our Citizens) is in their education. We are all better off when we have an educated population. An educated workforce is able to command better income and thus become productive tax payers, which is a benefit to all of us. This effort should start with vigorous pre-school programs and continue through college or vocational training. Good public schools are the glue which binds communities together, and assures the future of the next generation. Finally we need to take care of the environment. If you don’t maintain your car it won’t run; if you don’t take care of your house it won’t give you shelter. If we fail to take care of the planet then the rest doesn’t matter. These are the issues that I am running on: I want to promote ideas and cooperation and not a confrontational ideology. We are all truly in the same boat: it won’t float if we bail out the bow and sink by the stern.",
      "Website:" : "http://jimwhiteforcongress.com/"
    },
    "Missouri" :     {
      "State:" : "Missouri",
      "Candidate:" : "Maria Chapelle Nadal",
      "District:" : "1st",
      "Party:" : "Democrat",
      "About" : "As a former State Representative and current State Senator, Maria Chappelle-Nadal has an 11-year track record of advocating for all of her constituents, including marginalized communities. Now, she is running to represent Missouri's 1st congressional district in the U.S. House to ensure the residents of St. Louis have access to a clean and safe environment, quality education, and the basic resources needed to lead full and successful lives. Maria’s Background Maria was born in St. Louis, where she was raised by a single mother who worked two jobs to support their family. As a child, Maria had a speech disability that often kept her from talking at all. Through speech therapy she developed a strong voice, and she has been using it ever since to advocate for the issues impacting the St. Louis community. Maria received a dual degree in Political Science and Sociology from Georgia State University. Legislative Work In 2004, Maria was elected to the Missouri House of Representatives, and was re-elected for two additional terms. In 2010, she was elected to the Missouri State Senate and to the University City School Board. In the Senate, she has served on the Education Committee, the Seniors, Families and Children Committee and the Veterans’ Affairs and Health Committee. Maria has championed legislation on a variety of issues, including bills related to sex education (SBs 713 and 672), gun safety (SBs 739 and 740), election protection policy (SBs 755, 756 and 757), #Ferguson focused policy (SBs 671, 741, 758, 761, 763), and radioactive waste recovery, maintenance and accountability (SBs 600 and 601). As Missouri’s Senior Advocate from 2002, Maria successfully helped shepherd legislation such as the Senior Care and Protection Act of 2003 and the Missouri Senior Rx Generic Drug Rebate. Maria is a member of NOBEL/Women, the National Foundation of Women Legislators, the National Hispanic Council of State Legislators, the Missouri Legislative Black Caucus, and the Young Elected Officials Network. She served as a member of the Democratic National Committee from 2005 - 2009, and as a Director of the University City School Board from 2010 to 2015. Professional Life Maria has dedicated her public service to advocating for improved conditions for the St. Louis community. She volunteered as a board member of The Women’s Safe House, The Institute for Peace & Justice and serves as a frequent Ready Reader in both public and private area schools. Maria has received numerous awards, including the Barbara Jordan Leadership Award from the Young Elected Officials Network (2015), the St. Louis Business Journal Legislative Award (2014), the Senator John Heinz Memorial Award from the National Adult Day Services Association (2013), MO Alzheimer’s Association Outstanding Leadership Award (2010), the St. Louis Hispanic Leaders Group Esperanza Award (2008), the Missouri Association for Social Welfare Legislative Award (2008), and the St. Louis Freedom of Choice Award (2006). In 2002, Maria was one of sixteen national fellows chosen by the National Organization for Black Elected Legislative/Women and the Center for American Women in Politics (CAWP) at Rutgers University. She is a former participant of the Sue Shear Institute for Women in Public Life (2004), and the Neighborhood Leadership Academy at the University of Missouri-St. Louis (2002).",
      "Website:" : "http://www.maria2016.com/issues/"
    },
    "Nevada" :     {
      "State:" : "Nevada",
      "Candidate:" : "Lucy Flores",
      "District:" : "4th",
      "Party:" : "Democrat",
      "About" : "I’m running for Congress to help more people get the opportunities they need to get ahead in this economy. Lucy FloresI don’t have the background of a typical politician, but I have personally experienced the impact an investment in people can have on their future. It is what motivates me to give back to our community and what inspired me to run for office. I grew up in a challenging environment, and like too many kids in Nevada, I fell through the cracks. I dropped out of high school, but through hard work and the investment of people who cared for and believed in me, I got my GED, enrolled at the Community College of Southern Nevada Cheyenne Campus, and earned my bachelor’s degree at the University of Southern California as a transfer student. I went on to earn my law degree at the UNLV Boyd School of Law and was recognized with multiple awards for my work and accomplishments in the community. I ran for office to represent our community, serving as State Assemblywoman for four years in Assembly District 28, which was mostly located in Congressional District 4. In office, I successfully passed improvements to the way young people are tested by our high schools, protected consumers from predatory practices, and shielded victims of domestic violence from abusers. RSC_1249In Congress, I will focus on investing in our workforce and our future. I will fight, as I always have, for an increase in the minimum wage and to hold down health care costs. I will fight for small businesses and fight to bring good paying jobs with benefits to Nevada. I know that the jobs of the future require strong schools for our children and access to affordable debt-free college education. I will honor our service members and veterans by making sure they are taken care of abroad and at home. And I will protect Social Security and Medicare against Republican attacks to undermine them and work to expand coverage and benefits. I will also fight for women’s health, reproductive justice and economic empowerment Nevadans embody the western tradition of hard work and fair play, and I will work every day to level the playing field for our children, families, and workers, ensuring everyone who desires has the opportunity to achieve their version of the American Dream.",
      "Website:" : "http://www.lucyflores.com/"
    },
    "Nevada" :     {
      "State:" : "Nevada",
      "Candidate:" : "Alex Singer",
      "District:" : "3rd",
      "Party:" : "Democrat",
      "About" : "IT'S TIME THAT THE PEOPLE IN THE 3RD DISTRICT IN NEVADA HAD A REPRESENTATIVE WHO REPRESENTED THEIR INTERESTS! Home Donate Get Involved On The Issues Get To Know Me Enter text Enter text I come from a humble, middle class background growing up in Las Vegas. I have two wonderful, loving and hardworking parents who instilled morals and ideals that I carry with me to this day. My mom, Carol, a hard working woman has taught me the power of giving and caring for others that has driven me to get involved in politics. As my mom reminds me daily, even if you help just one person, that’s changing the world. My dad, Dennis, is the hardest working person I know, who just keeps going regardless of the odds. He has taught me the virtue of hard work, love and dedication. These beliefs and values that were instilled in me at a young age through today are what I will bring with me everyday in Washington. As for who I am as an everyday person. I am a husband to my beautiful wife Jessica, a brother to my two brothers, Reed and Shaun and an uncle to my niece and nephews. After years working on various political campaigns and in the private sector, I decided to attend college to further advance my ability to help and give back to the community. As for a more personal fact about me is that over 4 years ago I was diagnosed with a case of severe Ulcerative Colitis, an illness that is life changing, unseen and very humbling. Thanks in part to the Affordable Care Act, I have been given the access to medicine and doctors for the first time that have given me the edge and a fighting chance to beat this. A right to access and affordable healthcare is a right that I will protect for every citizen of the 3rd District. As for when I’m not campaigning and getting to know all of you, I am an avid reader and huge sports fan who enjoys watching, playing and attending sporting events when I can, with family and friends. When you send me to Congress, these ideals and who I am as a person will not change. I will spend every second of my time fighting for you, caring about the issues you care about and never forgetting who sent me there in the first place. I look forward to this campaign and introducing myself to you. Let’s go make history!",
      "Website:" : "http://www.singerforcongress.com/home.html"
    },
    "New Hampshire" :     {
      "State:" : "New Hampshire",
      "Candidate:" : "Shawn O'Connor",
      "District:" : "1st",
      "Party:" : "Democrat",
      "About" : "None of Shawn's grandparents graduated from high school. His grandmother worked the third shift, packing chocolates at a Whitman's factory while raising three children, and his grandfather was a wallpaper hanger. As a result of his grandparents' hard work and faith in the \"American Dream,\" Shawn's mother went to college, became a member of the NEA and taught for 30 years. She instilled in Shawn the importance of education and organizing. With scholarships and affordable student loans, Shawn's father became a doctor and opened a \"pay what you can clinic\" in his poor neighborhood. Shawn's dad taught him about service and responsibility to one's community. Shawn will bring these values to Washington as he also leverages his management, strategy, and negotiating experience to get real results in education, healthcare, job creation, and combating economic inequality. And unlike so many Washington politicians today, Shawn will always be available to listen to his constituents and address each and every one of their concerns. He will put \"service\" back into \"public service.\" As a result of the values he learned from his parents, Shawn went on to become a successful educational/social entrepreneur, a proven job creator, and an active community leader who is deeply committed to bridging the partisan divide in Washington in order to facilitate the passage of pragmatic public policies that will ensure affordable, high quality healthcare and education for all \"Granite Staters\" and all Americans. When Shawn was 16, he was alone with his father when his father suffered a life-altering aneurysm that left him permanently disabled. Shawn's family made ends meet with the help of Social Security Disability Insurance. Recognizing from his personal experience how important Social Security is, Shawn will guarantee the long-term security of Social Security and Medicare Shawn, who started working at 16 as a server at TGI Friday's will address income inequality by raising the minimum wage to $15 while protecting our vital small businesses. A results-oriented leader, in solidarity with the Granite State's working families, Shawn will only accept the minimum wage salary of $15,080/year until legislation is enacted to raise the federal minimum wage to $15/hour. The remaining $159,000 of Shawn's Congressional salary will be donated to New Hampshire charities by a citizens' commission. Shawn is the founder of Stratus Prep, the world’s leading independent test preparation and admissions counseling firm. Shawn launched Stratus Prep from a small apartment with just $5,000, his entire life savings at the time. The multi-million dollar company was recently named (for the second consecutive year) to the Inc. 5000 (a list of the 5,000 fastest-growing private companies in the nation), ranking #19 in the education industry. Living true to the values of service and education imparted by his family, Shawn helped over 4,000 applicants from all social backgrounds achieve admission to their top choice colleges, business schools, law schools, and graduate schools, many with full scholarships. Over the last three years, Stratus Prep helped its students win over $20 million in scholarships. A creative problem-solver who is deeply committed to educational equity, Shawn also founded The Stratus Foundation, a 501(c)(3) non-profit which provides free test preparation and admissions counseling scholarships to economically underprivileged applicants and ensures that no one is left behind in our increasingly competitive educational environment. Shawn has written for/been profiled in Forbes, U.S. News and World Report, Fortune, Bloomberg Businessweek, The Wall Street Journal, among other leading publications. Shawn has traveled across the U.S. and around the world speaking at the world’s top universities, corporations, and non-profit organizations about higher education. Shawn will bring the same energy and commitment to his work on behalf of Granite States in Washington. Shawn received his Master’s in Business Administration with Highest Honors (Baker Scholar) from Harvard Business School and his Juris Doctor, cum laude from Harvard Law School. Shawn graduated summa cum laude and Phi Beta Kappa from Georgetown University’s Walsh School of Foreign Service where he majored in international politics. Shawn is admitted to the bar in a number of states. An active community leader, Shawn has served on numerous non- profit and corporate boards, and has worked in various political capacities on the federal, state, and local level. Shawn currently serves on the board of City Year New Hampshire and Red River Theatre in Concord. He is also the Treasurer of St. Matthew’s Church in Goffstown.",
      "Website:" : "http://shawnfornh.com/"
    },
    "New Hampshire" :     {
      "State:" : "New Hampshire",
      "Candidate:" : "Anne Kuster",
      "District:" : "2nd",
      "Party:" : "Democrat",
      "About" : "When Annie Kuster was first elected to Congress, she pledged to bring a new approach to Washington, DC. Annie's number one priority is to look out for the best interests of Granite Staters, and she believes Members of Congress must reach across party lines to end the gridlock in Washington. In her short tenure in Congress, Annie has established a record of putting aside party politics to focus on the issues that matter most to Granite Staters. She's worked with members of both parties to prioritize job creation and support New Hampshire veterans, women, students, and seniors. When Annie was elected in 2012, she saw that many hardworking New Hampshire families were still hurting from the economic downturn. Annie committed to strengthening the New Hampshire economy, so that regardless of national trends, the economic security of our Granite State families would always be protected. In office, Annie has fought to cut taxes for Granite State small businesses, to help them expand and create more jobs. She has hosted a series of job fairs throughout the state, where she connected hundreds of job seekers with employers looking to hire. And the first bill Annie introduced in Congress would cut taxes for New Hampshire employers who partner with schools to provide job training for Granite State students so they are prepared to join the 21stcentury workforce. A member of the House Veterans’ Affairs Committee, and the daughter of a WWII veteran and POW, Annie is strongly committed to ensuring our veterans have access to the resources and support they need. She successfully fought for the opening of two new VA clinics in Colebrook and Berlin, to improve access to health services for North Country veterans. Annie helped pass a package of legislation, including her own bill, to help eliminate the claims backlog for VA benefits. And she worked with Republicans and Democrats to pass into law comprehensive VA reforms to ensure New Hampshire veterans can receive medical care sooner and closer to home. Annie is a proud New Hampshire native, born and raised in Concord. Her parents were community leaders who taught her the importance of public service through example. Annie's mother, Susan McLane, served in the New Hampshire State Senate and was a fierce advocate for equal rights and a true pioneer for women. Her father, Malcolm McLane, served as Mayor of Concord, was on the Executive Council, and ran for Governor as an Independent in 1972. Annie received her undergraduate degree from Dartmouth College in 1978, and was a member of the third class of women to graduate from the college. She received a law degree from Georgetown University Law Center in 1984, and then went on to work as an adoption attorney for 25 years. A strong advocate for her community, Annie has served on the boards of the New Hampshire Charitable Foundation, New Hampshire Public Radio, the Capitol Center for the Arts, and Child and Family Services of New Hampshire. Annie lives in Hopkinton with her husband Brad, an environmental attorney, where they raised their two sons Zach and Travis.",
      "Website:" : "www.kusterforcongress.com/"
    },
    "New Jersey" :     {
      "State:" : "New Jersey",
      "Candidate:" : "Alex Law",
      "District:" : "1st",
      "Party:" : "Democrat",
      "About" : "A bright young leader from Southern New Jersey who is a voice for anti-corruption and innovative economic development, Alex Law is launching a primary challenge to Congressman Donald Norcross. In Alex’s community, a political machine run by the Norcross family has stifled opportunity for far too long. Alex is running in this election to give his community the kind of honest leadership it deserves and to inspire all generations of Democrats through his creative ideas and unshakable passion for progressive values. Alex will use his experience as a strategy consultant at IBM, his knowledge as a 4th generation Collingswood Democrat, and his finance education from NYU Stern to champion the community. When Alex brings his innovative ideas and passion to Washington D.C., he will be the youngest Congressman in the United States of America.",
      "Website:" : "http://www.alexlawforcongress.com/"
    },
    "New Jersey" :     {
      "State:" : "New Jersey",
      "Candidate:" : "Eloy Delgado",
      "District:" : "8th",
      "Party:" : "Democrat",
      "About" : "I am passionate about social justice and reform. As a young progressive Democrat, I have been fortunate to benefit from policies that allowed me to enter the middle class. I don’t owe anyone any favors and I don’t take money from special interest groups. I believe the middle class needs to be represented by someone who is middle class. I cannot afford to quit my job nor do I have hundreds of thousands of dollars to invest in this campaign. What I do have is a passion to represent and advocate for the needs our residents. I am fierce advocate of honest and transparent government. Government works best when it is accountable to the people and government cannot be accountable if our elections are noncompetitive. Ultimately, I am running for office in order to do my part in helping all children achieve their full potential. Our problems may seem immense but I am fully optimistic in our ability in renewing the promise of the American dream but we can only do that with representation that believes that everyone is worthy of dignity. Some of you may not always agree with me, but what I can pledge to you is that I will always be ethical. The majority of our excitement in our political system exists only in the Presidential Election. However, The Congress is a co-equal branch of government and without strong progressives in Congress, we will not make legislative progress in our country. We need effective representatives who will be relentless in our advocating for progressive causes.",
      "Website:" : "http://www.eloyjdelgado.com/"
    },
    "New Jersey" :     {
      "State:" : "New Jersey",
      "Candidate:" : "Peter Jacob",
      "District:" : "7th",
      "Party:" : "Democrat",
      "About" : "My name is Peter Jacob, and I want to represent you, your family, and your community in the United States Congress. I grew up in Union, NJ in a beautiful home, in a safe and caring community. After attending Union County College, I worked to earn a degree in Sociology from Kean University, and later obtained my master’s degree from Washington University in St. Louis, with the top ranked social work school in the country. My collegiate career was spent as a student activist and leader, working with the Coalition Against Trafficking in Women (CATW), the YWCA, and the International Institute. Through these and other community organizations, I had the honor of fighting the ongoing scourges of child abuse, human trafficking, and the disastrous Iraq War, while campaigning proudly for healthcare reform, environmental sustainability, and immigrant integration. My new found skills and passion for public service were utilized early on as I returned to New Jersey and began work as a community organizer, developing and maintaining a homeless shelter program through a coalition made of churches, businesses, schools, hospitals, and individuals. I vividly remember a government official once describing the position as “the last pit stop before hell” for the most vulnerable in the area. I witnessed firsthand how the financial crisis caused by incessant greed impacted countless families who lost their homes, jobs, and health coverage. The experiences of aiding the most vulnerable among us sticks with me to this day; our neighbors who battle severe psychiatric disabilities, alcohol and drug abuse, to senior citizens having to choose between medicine and food, to working class families and children seeking life-saving assistance. We served so that those seeking a way out of poverty would have the opportunities to do so.",
      "Website:" : "peterforcongress.com/"
    },
    "New York" :     {
      "State:" : "New York",
      "Candidate:" : "Zephry Teachout",
      "District:" : "19th",
      "Party:" : "Democrat",
      "About" : "Ran For Governor of New York. Progressive champion and 'Bernie Sanders Democrat' ",
      "Website:" : "http://www.zephyrteachoutforcongress.com/"
    },
    "New York" :     {
      "State:" : "New York",
      "Candidate:" : "Bill Perkins",
      "District:" : "13th",
      "Party:" : "Democrat",
      "About" : "From working as a community organizer to becoming the third highest ranking member of the New York City Council to now serving as State Senator, Bill Perkins has built a record of hard work, passion and getting results. That's why in 2005, The Nation magazine named him as one of eight most effective progressive city leaders in the country. Perkins_Child_Photo.jpgElected in 2006, Bill Perkins now serves as State Senator representing the 30th District, and was one of the first NYS elected officials to support Barack Obama for President. The District includes Harlem, the Upper West Side and Washington Heights and was previously represented by former NYS Secretary of State Basil Paterson, former State Comptroller Carl McCall and former Governor David Paterson. When he got to Albany, it quickly became clear to him that Albany didn't need another go-along, get-along legislator -- and it wasn't what this district needed either. Instead, he has worked to make a difference -- to fight for reform, transparency and accountability, to take on the status quo and the special interests and to be a voice for fairness, basic justice and the people of his district. As Chairman of the Corporations, Authorities & Commissions Committee, he led the fight in the State Senate for the law to reform our public authorities like the MTA, and to take their operations out of the shadows, make sure their finances are scrutinized and that they are serving the people. He fought to pass the Power for Jobs Plan that has created thousands of good paying jobs, worked to extend unemployment benefits and to make health care more accessible and he has fought for tenants and affordable housing. And he led the successful fight for legislation reducing sulfur in heating oil, making it easier for New Yorkers with respiratory conditions to breathe and helping reduce acid rain. A lifelong resident of Harlem, Bill was raised by his mother together with his two brothers and a cousin. While she didn't have much to give him financially, she fought to get him into good schools and instilled him the importance of a good education. With hard work and the help of the community, Bill graduated from the Collegiate School and then Brown University. Starting his political career as a community activist and tenant leader, he was elected three times to the City Council and was chosen by his colleagues to serve as Deputy Majority Leader and Chair of the Government Operations Committee. Legendary columnist Jack Newfield described Bill as \"a legislator who has no fear and limitless empathy for life's casualties.\" Bill Perkins spearheaded the successful fight to protect children from the deadly effects of lead in their homes and his leadership resulted in the enactment of The Childhood Lead Paint Poisoning Prevention Act of 2004 to protect children from the deadly effects of lead in their homes. New York now has the best preventions in the country and according to the Mayor's \"Take Care New York\" report has experienced a dramatic decrease in lead poisoning cases. For winning this fight, Juan Gonzales in the Daily News called Bill Perkins \"a hero\" and wrote, \"It took the stamina of a long-distance runner to prevail against the city's powerful landlord lobby, which has resisted stronger lead paint removal laws for decades.\" A colon cancer survivor, Bill Perkins knows how important early detection is. He has been successful in setting up early detection programs in city hospitals so that other colon cancer victims will survive and he has helped safeguard the health of children and adults by fighting asthma, infant and maternal mortality, HIV/AIDS and making quality health care more accessible to all New Yorkers. Perkins_Library_Photo.jpgA strong supporter of public education, Bill Perkins has fought to give every single child the same chance to succeed that he was given. He made sure that funding for computer technology, public libraries and the rehabilitation of school playgrounds remain a municipal government priority. Fighting and winning funding to increase The City University of New York (CUNY) scholarships, full-time faculty staffing and college prep courses, Perkins is a leading voice to maintain the public university's mission of access and excellence. Called an \"anti-rat crusader,\" Bill Perkins has fought the plague of rats on our streets. Serving as Chair of Council's Select Committee on Pest Control, he organized a citywide Rat Summit, authored a comprehensive strategy to solving the City's rat problem and forced the Mayor to act. Even now, some newspapers still refer to him as the \"Rat Man.\" Bill Perkins was an early, vigorous opponent of the War in Iraq. He introduced and passed an anti-war resolution - one of the first in the nation -- in the City Council and led the fight to pass a resolution to protect our civil liberties and rights by mandating that the Patriot Act not infringe upon the fundamental rights and liberties of New Yorkers. When peaceful demonstrators rallying during the Republican National Convention were wrongly arrested, held in unsafe conditions and denied basic rights, Bill Perkins was the first to hold hearings and expose the abuses. And Bill didn't stop there. He's stood tall for free speech and equity, opposed racial, ethnic and religious profiling, sponsored landmark Legislation to protect the rights of the gay, lesbian and transgender community and he led the fight for the Living Wage Bill to provide a minimum wage that was also a living wage. Now in the State Senate, Bill Perkins continues to fight for transparency and accountability, to knock down barriers and create opportunity and to be a loud voice for those that too often have no voice in Albany.",
      "Website:" : "www.billperkins.org/"
    },
    "New York" :     {
      "State:" : "New York",
      "Candidate:" : "Eric Kinson",
      "District:" : "24th",
      "Party:" : "Democrat",
      "About" : "",
      "Website:" : "cant find one"
    },
    "New York" :     {
      "State:" : "New York",
      "Candidate:" : "Diana Hird",
      "District:" : "18th",
      "Party:" : "Democrat",
      "About" : "",
      "Website:" : "http://www.dianahird.com/"
    },
    "North Carolina" :     {
      "State:" : "North Carolina",
      "Candidate:" : "John McNeil",
      "District:" : "13th",
      "Party:" : "Democrat",
      "About" : "I am running for the House of Representatives because North Carolina needs a Representative who represents The People, All of the People, and not just the 1% who are currently over-represented in the U.S. House of Representatives. I am a veteran of the Marine Corps. I was born into the military community and became a “military brat” as we are often called. I had the pleasure of spending most of my youth in and around the military. Joining the military after high school was an easy choice for me: I graduated from high school when the country was in the grips of Reagan’s implementation of his “trickle down” economic policies, which ensured there were few meaningful employment opportunities or opportunities to send me to college. After attending Parris Island for recruit training, in 1987 I was stationed at Camp Lejeune as a Scout with 2ndLight Armored Reconnaissance Battalion. I remained with 2nd LAR throughout my enlistment, eventually achieving the rank of Sergeant. I participated in the Panama Invasion, Desert Shield, and Desert Storm. After my honorable discharge, I attended North Carolina public universities to achieve my Bachelor of Arts Degree in Political Science and attended law school at Wake Forest University. I currently own and operate a law firm and mediation service in Raleigh, North Carolina. Over the past thirty years I have watched as Presidents and Congresses have made cuts and passed legislation that only benefits their friends and campaign donors. I have watched as politicians use spin and lies to sway the American people into taking actions or voting against their own interests. I have watched politicians advocate for taking unnecessary risks with our troops lives without any concern for the warriors' return, their transition into civilian life, or the impact on their families. These same politicians seem to have no concern for the very real strategic, economic, or geopolitical consequences of those decisions. I have watched as politicians use divisive tactics to deny basic human rights and subjugate underrepresented segments of the population based solely on race, gender, income, and personal health decisions. As a lawyer, I have seen the very real impact that lax fiscal policies and failure to implement any oversight has had on the American economy, American workers, and their families. In the past two decades, lives and families have been destroyed by the Dot-Com Bubble, the Housing Bubble, and the Financial Securities Bubble. Our politicians have bent over backwards to bail out mortgage companies, banks, investment firms, and automakers. The Middle Class has been left holding the bill for these bailouts and asked to sacrifice more and more as these same industries continue their same practices. In the coming years, there will be a Student Loan Bubble as students and workers struggle to find good-paying jobs or make payments while wages remain stagnant or decrease. Once again, the Middle Class will be left holding the bill while those truly responsible will be bailed out. Despite decades of these bubbles, Washington continues to relax rules and safeguards that would protect us from these bubbles. Despite these financial catastrophes, Washington has given industry lobbyists side-door access into Legislators' offices so these industries can, once again, be saved from the consequences of their actions. As always, the Middle Class is left holding the bill. Over those many years, the American Dream has been eroded. It is time for REAL change in Washington. America needs less talk and a lot more action. It is because of this constant assault on the American Dream and a chance to make a real difference that I chose to run for the US House of Representatives. I am committed to representing ALL the people of the 13th District and not just the chosen few.a",
      "Website:" : "johnpmcneil.com/"
    },
    "North Carolina" :     {
      "State:" : "North Carolina",
      "Candidate:" : "George K. Butterfield",
      "District:" : "1st",
      "Party:" : "Democrat",
      "About" : "Congressman G. K. Butterfield is a lifelong resident of Wilson, N.C., and has served the people of the First Congressional District of North Carolina since 2004. His father was a well-respected dentist and elected official in Wilson, N.C., and his mother was a classroom teacher for 48 years. Congressman Butterfield graduated from Charles H. Darden High School before earning a Bachelor of Arts degree from North Carolina Central University (NCCU), in Durham, North Carolina. He later earned a Juris Doctorate degree from NCCU School of Law. For 14 years, Congressman Butterfield practiced law in his home community, and was best known for his success with several eastern North Carolina voting rights lawsuits that resulted in African-American communities having the ability to elect candidates of their choice to public office. In 1988, Congressman Butterfield was elected Resident Superior Court Judge for the First Judicial Division. For the next 12 years, he presided over civil and criminal court in 46 counties across North Carolina. In February 2001, then-Judge Butterfield was appointed to the North Carolina Supreme Court but was defeated in the November 2002 election. After his defeat, he was then appointed to the Superior Court bench and resumed his duties as a trial judge. After serving 15 years as a state judge, in 2004, Congressman Butterfield retired after being selected as the Democratic nominee in the special election to fill the unexpired term as U.S. Representative for North Carolina’s First Congressional District. He was first elected on July 20, 2004, and continues to serve today. In the 110th Congress, Congressman Butterfield became part of House leadership with an appointment as a Chief Deputy Whip. Chief Deputy Whips are responsible for helping to formulate policy and for ensuring the passage of legislation. bio bridge pic Congressman Butterfield is the first Democrat from North Carolina to serve as a Chief Deputy Whip and continues to serve in this position today. Congressman Butterfield serves on the powerful House Committee on Energy and Commerce. He is a member of the Subcommittees on Health, Communications and Technology, and Oversight and Investigations. He previously served as the Ranking Democrat on the Subcommittee on Commerce, Manufacturing and Trade. Congressman Butterfield is an honorably discharged veteran of the U.S. Army. His family includes adult daughters Valeisha, Lenai and Tunya; and son-in-law, Dahntay.",
      "Website:" : "gkbutterfield.com/"
    },
    "North Dakota" :     {
      "State:" : "North Dakota",
      "Candidate:" : "Cory McGarney",
      "District:" : "1st(and only)",
      "Party:" : "Democrat",
      "About" : "Why I am running. I am a son of a single mother who worked and went to college while raising 4 children. During this time I learned a lot about hard work. I have worked in multiple industries and have learned quite a lot about the industries in this state. I have been an advocate for the working and middle class for an extended time. I proudly endorse the candidacy of Senator Bernie Sanders for President. I will be campaigning for him as well as myself. I stand for Progressive policies that will help rebuild the middle class. A living wage of no less than $15 an hour is needed to move America forward. We need to return to middle class economic policies. Income inequality has decimated the American Dream. We need progressive tax rates that are fair to the working and middle class as well as equal pay for equal work, regardless of gender or race. I am a pro-choice candidate that is personally against abortions but understands that I cannot put my personal beliefs above someone's Constitutional rights. I stand with the LBGT community in their fight for equality in all ways. I am avidly against the use of corporate funds in the electoral process. The Citizens United decision has polluted the election process. I am a Bernie Sanders style Independent although I will be running as a Democrat in North Dakota. It's time we have real people in Congress..",
      "Website:" : "http://www.coryforcongress.com/"
    },
    "Ohio" :     {
      "State:" : "Ohio",
      "Candidate:" : "Janet Garnett",
      "District:" : "4th",
      "Party:" : "Democrat",
      "About" : "",
      "Website:" : "www.janetgarrett.com/"
    },
    "Ohio" :     {
      "State:" : "Ohio",
      "Candidate:" : "Keith Mundy",
      "District:" : "16th",
      "Party:" : "Democrat",
      "About" : "",
      "Website:" : ""
    },
    "Ohio" :     {
      "State:" : "Ohio",
      "Candidate:" : "Marcia Fudge",
      "District:" : "11th",
      "Party:" : "Democrat",
      "About" : "Congresswoman Marcia L. Fudge is a committed public servant who brings a hard-working, problem-solving spirit to Congress and to the task of creating jobs, protecting safety net programs, and improving access to quality public education, health care and healthy foods. First elected in 2008, she represents the people of the 11th Congressional District of Ohio. Congresswoman Fudge serves on the House Committee on Agriculture and the House Committee on Education and the Workforce. She is the Ranking Member on the Subcommittee on Early Childhood, Elementary and Secondary Education. She is also a member of several Congressional Caucuses and immediate past Chair of the Congressional Black Caucus. In 2014, Congresswoman Fudge became an original co-chair of the Democrats for Public Education. Congresswoman Fudge consistently fights for equitable access to a quality education from preschool through post-secondary programs, child nutrition, food stamp (Supplemental Nutrition Assistance Program) recipients, access to locally grown, healthy foods, fair labor practices, and civil and human rights, among other issues. Additionally, she was an early and consistent voice for voter protection and remains a steadfast advocate to strengthen and preserve Social Security, Medicare and Medicaid. Congresswoman Fudge has served the people of Ohio for more than two decades, beginning with the Cuyahoga County Prosecutor’s Office. She was the first African American and the first female mayor of Warrensville Heights, Ohio, where she led the city in shoring up a sagging retail base and providing new residential construction. Congresswoman Fudge earned her bachelor’s degree in business from The Ohio State University and law degree from the Cleveland State University Cleveland-Marshall School of Law. She is a Past National President of Delta Sigma Theta Sorority, Inc., and a member of the Greater Cleveland Alumnae Chapter. Congresswoman Fudge’s work ethic, problem-solving approach, and ability to build collaborative relationships has earned her a reputation among her colleagues in Washington and at home as an insightful leader and knowledgeable legislator. As a dedicated public servant, she begins each morning with a firm promise “to do the people’s work.” It is this simple philosophy that defines Congresswoman Fudge as a Member of substance and character who always keeps her promise.",
      "Website:" : "marcialfudge.com/"
    },
    "Oklahoma" :     {
      "State:" : "Oklahoma",
      "Candidate:" : "Tom Guild",
      "District:" : "5th",
      "Party:" : "Democrat",
      "About" : "",
      "Website:" : "http://www.guildforcongress.com/"
    },
    "Pennsylvania" :     {
      "State:" : "Pennsylvania",
      "Candidate:" : "Kerith Strano Taylor",
      "District:" : "5th",
      "Party:" : "Democrat",
      "About" : "Kerith Strano Taylor is an advocate. Kerith is someone that fights for what she believes in. It is time for REAL changes to happen in the 5th District and there is only one candidate that can do it. That candidate is Kerith Strano Taylor and the best choice for Congress. Kerith Strano Taylor is widely recognized as an ethical and effective negotiator, a person who can help transform the most heated disagreements into amicable solutions that work for all the parties involved. She is a smart and savvy leader, a woman who brings out the best in others and encourages collaboration to solve critical problems. She intends to bring these much needed skills to Congress in 2016. Through her professional work as a Family Law Attorney and her numerous volunteer efforts, Kerith Strano Taylor has become known throughout the Commonwealth as a champion for children and families. Since 2004, Kerith has served as Guardian ad Litem for Jefferson County, representing children who find themselves in the foster care system. Through that work, Kerith became an active member of the Statewide Children’s Roundtable Initiative in 2006 when it was created by Supreme Court Justice Max Baer. Her leadership was widely recognized, and in 2011 she helped design and lead an affordable, accessible, and timely training for over 350 Guardian ad Litem and Parents’ Attorneys. Kerith also sits on the Jefferson County Children’s Roundtable, the regional Leadership Roundtable 7, and the Statewide Children’s Roundtable. In these efforts, Kerith collaborates with judges, attorneys, social workers, and others to improve the practice of Pennsylvania Dependency Courts, striving to ensure the safety and well-being of every child in the dependency system. In 2011, the Pennsylvania Supreme Court appointed Kerith to the Juvenile Court Procedural Rules Committee, where she is helping to improve the rules governing actions for juvenile delinquency and dependency courts. Growing up in a working class family in Jefferson County, she and her brother spent most afternoons doing their homework in the auto shop her parents owned in Brookville, Pennsylvania. A product of a stellar public education provided by the Brookville Area School District, Kerith started college at The Pennsylvania State University in 1992 at age 16. Her respect for American government was born during the summer of 1994 when Kerith was awarded the Lyndon Baines Johnson Congressional Fellowship and served on Capitol Hill under the guidance and tutelage of former Congressman William J. Clinger. Graduating with a B.A. in Political Science in 1996, Kerith spent the next two years working in government affairs in Washington D.C. before enrolling at George Mason University School of Law. She earned her law degree in 2001 and immediately returned to her hometown of Brookville where she opened her own firm and still practices today. In 2013, Kerith was asked by the Jefferson County Court of Common Pleas to conduct custody conciliation conferences for those families who are unrepresented by counsel. She has been highly successful in these efforts, helping families to settle cases in a timely, efficient, and civil manner. Kerith lives in Brookville, where she is the proud mother of two children, Laurin Elise and Ethan Anthony. She is an avid motorcycle rider and enjoys riding through the district. Come Join the Revolution with Kerith. Come join her in the fight to make sure that moneyed interests do not run away with our Democracy. Kerith Strano Taylor ensures that your voices are heard, and reminds this “do-nothing” Congress that the American dream is not just for the wealthy.",
      "Website:" : "http://kerithstranotaylorforcongress.com/"
    },
    "South Carolina" :     {
      "State:" : "South Carolina",
      "Candidate:" : "Dimitri Cherny",
      "District:" : "1st",
      "Party:" : "Democrat",
      "About" : "Dimitri Cherny is a champion for the people. At one time he had it all - a long career in the high-tech industry which took him all over the world, a custom home in an exclusive seaside community, a hefty salary, and a large 401k. Then the recession hit and he lost everything. Unable to find work, his resources drained away until he found himself homeless. Dimitri eventually found work as a long distance truck driver, where he met an America he didn’t know existed. Many lived paycheck to paycheck, one car repair or medical bill away from disaster. He also met heroes - people who had taken a stand to make the world a better place. Forever changed by his experience, he joined them, working on issues of racial justice, education, gun violence, public transit, homelessness, and equal rights for all. Running for Congress is the next step. The challenges of a community can often be met by making changes in the law. In order to further his fight to ensure quality of life in the Lowcountry, Dimitri is running to replace Mark Sanford in Congress for the First Congressional District. Dimitri’s successful rise and unpredictable fall through the American economy made him realize how easily and unexpectedly any one of us could find ourselves in a similar situation. Roughly 75 percent of Americans are living paycheck to paycheck, many earning starvation wages and unable to put anything away in savings. Even those who are making larger salaries are on shaky ground, denied cost of living increases and robbed of job security and pensions. Looking to make an even bigger difference in the quality of life of Lowcountry residents, Dimitri believes that what's really needed is a fight for economic justice and the best way to do that is via federal legislation. That's why he's running for Congress.",
      "Website:" : "http://www.chernyforcongress.us/"
    },
    "Tennessee" :     {
      "State:" : "Tennessee",
      "Candidate:" : "Steve Cohen",
      "District:" : "9th",
      "Party:" : "Democrat",
      "About" : "On May 24, 1949, pediatrician Morris Cohen and his wife Genevieve welcomed Stephen Ira Cohen into the world, the fourth generation of their family to live in the city of Memphis. Steve took an early interest in politics at the age of five when stricken with polio. When he was eleven years old, John Fitzgerald Kennedy came to Memphis on a campaign stop, and Steve took a picture of him that still hangs in his office to this day. After graduating from the Cecil Humphreys School of Law at the University of Memphis, Steve became a legal advisor for the Memphis Police Department, while simultaneously serving as vice president of the 1977 Tennessee Constitutional Convention. From 1978-80, he served as Shelby County Commissioner. While a commissioner, he was a key player behind the establishment of The Med. And in 1982, he was elected to the Tennessee General Assembly as State Senator from District 30. As a Tennessee State Senator, he fought for eighteen years to overturn the state’s ban on lotteries so he could establish a scholarship fund for the children of Tennessee. In 2002, his efforts came to fruition, and the following year, the Hope Scholarship became a reality. Thousands of students from across Tennessee are attending college because of his hard work. He also championed bills granting greater access to medical care, the protection of animal welfare, the reinstatement of voting rights, funding for the arts, and graduated drivers licenses throughout his tenure in the state senate. In 2006, Steve announced that he would seek the 9th Congressional District seat in the House of Representatives previously held by Harold Ford, Jr. He won a hotly contested primary in August of that year before going on to win the general election in November. Since being sworn in on January 4, 2007, Steve has played an active role in the House of Representatives. He voted for each portion of the Democratic Party’s “Six for ’06”, which raised the Federal Minimum Wage for the first time in a decade, enacted the recommendations of the 9/11 Commission, broke the ties between lawmakers and lobbyists, halved the interest rates on student loans, ended tax subsidies to the oil companies, and granted federal funding for stem cell research. As a member of the House Judiciary Committee, he grilled then-Attorney General Alberto Gonzales over his attempt to pressure US Attorneys into partisan prosecutions. He has used his role as a congressman to champion greater access to medical care for children, lower Medicare drug prices, lower interest rates on student loans, and an official apology for slavery and the system of segregation-era laws that restricted the rights of African-Americans and to consistently stand up to President George W. Bush over his failed policies in Iraq. Because of his work ethic, Speaker of the House Nancy Pelosi referred to Cohen as “the conscience of the freshman class” in 2008. In August 2008, Cohen won the Democratic Congressional Primary by a huge margin, all but guaranteeing another term in Congress. In November of 2008, he won the General Election overwhelmingly In December 2008, Cohen was elected Regional Whip for the 111th Congress. He also traveled to Madrid, Spain to accept an award from The Vida Foundation honoring his bill that called upon the House of Representatives to apologize for its role in allowing slavery and the segregation era. In January 2009, He became Chairman of the Subcommittee on Commercial and Administrative Law. He has since introduced legislation calling for an examination of racial disparity in the criminal justice system, as well as a bill to prohibit the use of credit checks in pre-employment screening.",
      "Website:" : "http://cohenforcongress.com/"
    },
    "Texas" :     {
      "State:" : "Texas",
      "Candidate:" : "Tom Wakely",
      "District:" : "21st",
      "Party:" : "Democrat",
      "About" : "I was born in San Antonio and raised in a Catholic family. I am the oldest of six kids. Shortly after I graduated from Alamo Heights High School I enlisted in the US Air Force. I was only 17 yrs. old. It was the height of the Vietnam War. After my discharge from the military I returned to San Antonio and immediately joined César Chávez's Texas Farmworkers Union campaign. My pay was room and board, $ 5.00 a week, and all of the menudo I could eat. I worked for Chávez for about 2 years and my responsibilities included organizing the Grape Boycott in San Antonio. I was arrested twice and jailed for picketing outside HEB stores. Among my many strange experiences with the farm workers was an early 1972 episode when I and several other Farmworker staff members attempting to organize warehouse workers at the San Antonio Produce Terminal were chased from the facility by gunfire. The common thread in my work within the union movement was the faith community. I could always count on a priest, a minister, an imam or a rabbi, to walk the picket line with me. In 1985, I answered a different calling and entered the Chicago Theological Seminary; an ecumenical institution, one of seven seminaries historically affiliated with the United Church of Christ. While at seminary I organized the 1988 Congress on Religion & Politics. Featured speakers included Rabbi Michael Lerner, the editor of Tikkun, a progressive Jewish interfaith magazine based in Berkeley, California; and Jim Wallis, an evangelical Christian writer best known as the founder and editor of Sojourners magazine. In 2004, at the urging of Father Bob, the parish priest at St. Joseph’s, I took on a new challenge to help the low-income community of East Austin, a project that ultimately ended in failure. I was tasked to organize a community development bank, Azteca Community Bank, to serve the residents of East Austin. A bank charter application was eventually filed with the Texas Department of Banking; a hearing was held but the application was denied because the FDIC refused to offer insurance. The FDIC refused to provide insurance because I and the other organizers of the bank refused to appoint to our board of directors representatives from Wells Fargo, JP Morgan Chase and Bank of America. We all knew that what the FDIC was demanding of us was not only foolish but an unsafe and unsound demand. Despite the fact that everyone involved in this project lost all the money we had invested it was a wise decision given that less than a year later those very same financial institutions were responsible for the financial crisis of 2007–08, considered by many economists to have been the worst financial crisis since the Great Depression of the 1930s. We cannot let things continue on as they are. Our world, our country, our state, our congressional district is facing the end of times - not in the biblical or religious sense, but in the sense that the world as we know it, the world we grew up in, will not be the world we leave to our children or grandchildren. Climate change and corporate control over pretty much every thing is the new reality. But if we act together, and if we act now, we can stop climate change and reign in the corporations. We can ensure that our children and our grandchildren will inherit not just a safer world but a better world. And we can do this together if we can put aside our differences and concentrate on what we all have in common: our home - the Earth. There is much work to be done, and I look forward to rolling up my sleeves and tackling the tasks. I look forward to representing District 21 in Congress.",
      "Website:" : "http://www.wakely2016.com/"
    },
    "Texas" :     {
      "State:" : "Texas",
      "Candidate:" : "Sheila Jackson Lee",
      "District:" : "8th",
      "Party:" : "Democrat",
      "About" : "",
      "Website:" : "http://www.sheilajacksonlee18.com/"
    },
    "Texas" :     {
      "State:" : "Texas",
      "Candidate:" : "Juaquin Castro",
      "District:" : "20th",
      "Party:" : "Democrat",
      "About" : "Joaquin Castro is among the vanguard of a new class of Latino leaders emerging across the country. The Texas Tribune has called him a “rising star in his party,” and more recently, Politico.com named Joaquin one of the top 50 politicos to watch in the nation. Although Joaquin has established a distinguished legislative track record, his story shares the same humble origins that have come to define so many great stories about the pursuit of the American Dream. Joaquin, a second-generation Mexican American, was born in San Antonio, Texas on September 16, 1974. He was raised on the city’s Westside and is a proud product of the public school system. The Castro family’s history in the United States began nearly 100 years ago when his grandmother, Victoria Castro, came to Texas as a young orphan. In the spirit of the American Dream, she often worked two and three jobs at a time to be able to give her daughter (Joaquin’s mother, Rosie) and her grandchildren a better chance in life. Joaquin worked hard to seize the opportunities created by the sacrifices of his grandmother and prior generations. After finishing high school a year early, Joaquin left San Antonio to graduate with honors from Stanford University in 1996 and attend Harvard Law School where he received his Juris Doctorate degree in 2000. Upon his return, Joaquin was elected at 28 years old into the Texas Legislature and is currently serving his fifth term as state representative for District 125, while his identical twin brother, Julián Castro, was just re-elected to his second term as Mayor of San Antonio. Joaquin’s respect for public service developed at a young age and was deeply influenced by his parents’ involvement in political movements and civic causes. His father, a retired teacher, and his mother, a renowned community activist, instilled in him a deep appreciation for the democratic process and the importance of serving one’s community. As Vice Chairman of the Higher Education Committee and Democratic Floor Leader in the Texas House, Joaquin has been an effective leader in Texas politics, despite a difficult political environment. In this session alone, he transcended partisan gridlock to help restore millions of dollars in funding to critical health care and education programs. He has also been at the forefront in proposing forward-thinking legislative reforms in the areas of mental health, teen pregnancy, and juvenile justice. Outside of the legislative chamber, Joaquin has demonstrated a strong commitment to the community. He has created the Trailblazers College Tour, personally raising money to send underprivileged students on college visits, giving them exposure to some of the nation’s best institutions of higher education. He has also created SA READS, San Antonio’s largest literacy campaign and book drive. To date, over 200,000 books have been distributed to more than 150 schools and shelters across the city. Joaquin and his brother previously established a private litigation practice in San Antonio. He has also taught as a visiting professor of law at St. Mary’s University and as an adjunct professor at Trinity University. Joaquin is active on several boards of education-related, non-profit organizations, including Achieving the Dream, the National College Advising Corps, and the National Association of Latino Elected and Appointed Officials’ (NALEO) Taskforce on Education. Having experienced America’s promise firsthand, he wants to help build out what he calls the Infrastructure of Opportunity so that future generations will have the same chance to pursue their American Dream. He believes that just as there is an infrastructure of transportation that helps us get to where we want to go on the road there is an Infrastructure of Opportunity that helps Americans get to where they want to go in life. It is that Infrastructure of Opportunity – good public schools, great universities and a sound healthcare system – that enables Americans to pursue their American Dream. Our centuries-long commitment to building and preserving this infrastructure is what distinguishes America among the nations of the world. The potential for job creation and economic development in the region is tremendous. Joaquin will be a strong advocate in Congress for building out the Infrastructure of Opportunity in the 20th congressional district.",
      "Website:" : "http://www.castroforcongress.com/"
    },
    "Virginia" :     {
      "State:" : "Virginia",
      "Candidate:" : "Bill Bunch",
      "District:" : "9th",
      "Party:" : "Democrat",
      "About" : "Being nominated for the Democratic Nomination to the Ninth Congressional District’s seat in the United States House of Representatives is a longtime dream of mine. What is especially important to me is to help build and strengthen the local party unit into a force that no state or national office will go unopposed. No matter who wins our nomination for the house or presidency I will support and vote for them. We have the opportunity now, to return both houses of congress to democratic control, and I will work diligently to see that happen. Bill graduated from Elon College in 1971 with a major in history. The study of Southern, as well as World history opened his eyes to a more complete understanding of politics and government, thanks to the professors who encouraged him to look at issues from all sides and try to find the truth. Bill retired, after thirty years of service, from the U. S. Postal Service as a Rural Carrier, part-time Flex-clerk-carrier and Substitute. His involvement in the Rural Letter Carriers Union included all local offices; local, area and Assistant State Steward, and running for State Executive Board and National President. He was a past State PAC Chair. And presently is serving as State Provident Guild Rep., and has been elected to several national union conventions. Since retirement he has farmed, raising hay and vegetables, and served as manager of the Tazewell Farmers Market. His community service includes, 4-H and Scout volunteer; Active Master Gardener; youth basketball organizer, coach and referee; Tazewell County Fair department co-chair; YMCA volunteer; Food Pantry Donor; 47 year Blood Donor; Tazewell Theatre Group; and Scorekeeper for THS boys basketball team. Currently he is a member of the Farm Bureau, Four Seasons YMCA; Tazewell Book Study; Virginia Rural Letter Carrier’s Union; Nature Conservancy; Natural Resources Defense Council; National Parks Association; Yellowstone Coalition; Friends of Yosemite; American Postal Workers Union; NARFE; and the League of Conservation Voters.",
      "Website:" : "http://www.billbunch4congress.com/"
    },
    "Washington" :     {
      "State:" : "Washington",
      "Candidate:" : "Angela Marx",
      "District:" : "3rd",
      "Party:" : "Democrat",
      "About" : "Life-long resident of Clark County, WA in the heart of the 3rd Congressional District of WA State. Raised two daughters, helping to raise two granddaughters while my oldest child earns a Civil Engineering degree from PSU. In 2011 I had a heart attack. It woke me up in ways I can't even describe. It made me take a long, hard look at the future my children and grandchildren were facing. For the most part, I didn't like what I saw. I've been a political junkie since I watched the Watergate hearings live on tv when I was a young teenager. I've spent two decades urging every person I meet to become a registered voter or to help others become registered voters. I love my community and my country, with a deep and abiding passion. I know that sounds corny, but it's true. I offer the people at the 4th of July events I attend every year a $20 bill if any of them can recite the Preamble to the Constitution from memory - to date, no one has won that $20 and that saddens me greatly. What I want more than anything is for the people who I care about to have a decent life - and I want that for all the families here in SW Washington State, too. I care about the water and air and land, because I want my grandchildren's grandchildren to be able to enjoy the wonders of our beautiful region just as I and my kids do today. To that end, I want to become the next Congresswoman in Washington State's 3rd District - because I know that I can help the rest of the people of the 3rd District rise up to meet the challenges of the coming years with a reverence for our natural resources and an eye towards sustainable, decent paying jobs for our families and well-funded educational opportunities for our children. America used to be great for a reason, we did great things. We can again. Believe with me and together, we can do great things!",
      "Website:" : "www.angie4congress.com/"
    },
    "West Virginia" :     {
      "State:" : "West Virginia",
      "Candidate:" : "Mike Manypenny",
      "District:" : "1st",
      "Party:" : "Democrat",
      "About" : "Mike has fought to make a difference in WV. As a WV State Legislator for six years, Mike worked hard to try and bring balance between preserving jobs and protecting our environment. He worked with all interested parties to preserve the jobs we already have while working to improve WVs climate to attract new jobs and industry into our State, as well as holding those who put the health of our communities and environment at risk from pollution and carelessness accountable. During the biggest chemical spill in West Virginia’s history, as Chairman of the Joint Oversight Commission on the State’s Water Resources, Mike fought to bring accountability to all responsible parties for the spill. While investigating the chemical spill, Mike worked with State and Federal officials to become informed and worked on solutions to craft Legislation to prevent spills like this from ever happening again. Mike has been a champion of the people, working to improve the lives of our Seniors, Families, Children, Veterans, Farmers and all West Virginians. Working within the community, Mike has been instrumental in developing organizations and programs that help improve the community. In 1999 Mike Founded an Environmental group called Global Impact which promotes and advocates for conservation and recycling issues. Not long after that Mike was asked to become a Board member of the Northern West Virginia Centers for Independent Living, an advocacy organization that fights for the rights of the aged and disabled communities. Being active in the community is something Mike embraces fully and is a Founding member of several organizations including the Tygart Valley Chamber of Commerce, the Tygart Valley Child Advocacy Center, Project HOP2E Food Bank, and the Taylor County Farmers Market. He also sits on the Board of Directors of each organization including the Tygart Lake State Park Foundation, Taylor County Collaborative Family Resource Network, Taylor County Substance Abuse Task Force, and the Monongalia Solid Waste Task Force In order to improve West Virginia’s economy, Mike has worked hard to find ways to diversify our economy to bring more sustainable jobs and industry to WV so we don’t have to rely solely on the extractive industries to be the only driving force for jobs within our borders. Mike has also worked hard to get a Compassionate Medical Cannabis Use bill passed to allow Doctors the authority to recommend cannabis to patients who suffer from chronic and terminal illnesses, and using the taxes collected from the sales to promote substance abuse prevention programs in our schools and drug treatment programs in our communities! Defending our communities from irresponsible gas drillers, Mike was instrumental in developing common sense legislation to help regulate the Marcellus gas drilling industry to protect industry workers, neighbors, and our environment from potential irresponsible Marcellus drilling practices along with the high volumes of traffic required to extract these natural resources. Mike is also a proponent of GMO labeling so our citizens have more transparency and awareness of the food that they purchase and eat, overturning Citizens United, reinstating the Glass Steagall Act to protect our citizens federally insured savings, fighting discrimination against all people, increasing minimum wage, protecting women and worker’s rights, and eliminating corporate welfare These are just a few of the common sense approaches Mike has proposed to help WV and her citizens.",
      "Website:" : "http://mikemanypennyforcongress.com/"
    },
    "Wisconsin" :     {
      "State:" : "Wisconsin",
      "Candidate:" : "Tom Breu",
      "District:" : "1st",
      "Party:" : "Democrat",
      "About" : "My name is Tom Breu. I’m a Democrat running against Paul Ryan. Paul Ryan is a very loud voice trying to take our country in a very wrong direction, and he needs to be defeated. What’s this about? We’re all busy: Life, family, job. That changed for me when I attended, by chance, my first ever political event. On August 9, 2005, at Janesville Parker High School, economist Dean Baker debated Paul Ryan on privatizing social security insurance. I remember walking to my car afterward, aghast: How could this person have been elected with a viewpoint so narrow, so privileged, and so out-of-touch with the reality faced by so many? That was the spark. It has since become crystal clear that Paul Ryan is absolutely wrong for today’s America. At an even higher level, this is about Democracy itself. It’s about Democracy being swamped by Capitalism, Capitalism being corrupted by Wall Street, and Wall Street money the measure of all things.",
      "Website:" : "http://www.tomb4house.com/"
    }
  },
  "Senate" : {
    "Donna Edwards" :     {
      "Candidate:" : "Donna Edwards",
      "State:" : "Maryland",
      "Party:" : "Democrat",
      "Credentials/Platform:" : "Donna Edwards is a unique voice who will always put working families first. As the first African American woman ever elected to Congress in Maryland, she has taken on special interests from Wall Street to the NRA — and those who protect them — fought to protect and expand Medicare and Social Security, and worked to get big, corporate money out of politics. As a single African American mom, Donna’s seen how special interests can dismantle the middle class and hurt our most vulnerable. She’s never shied away from fighting back. That’s why she stood up to big developers and special interests in Prince George’s County to protect union jobs, build 400 family homes, and provide safe, reliable access to the natural environment. In Congress, Donna’s been a progressive fighter for women’s reproductive rights, never compromising on a woman’s right to a safe and legal abortion. She’s championed equal pay for equal work, authored legislation to support 10,000 Maryland jobs as a Ranking Member of the Space, Science, and Technology Committee, and ensured that thousands of meals have been served to low-income students across our state. And as the daughter of an Air Force Dad, she knows we must keep our promise to those who serve. In the Senate, Donna will carry on Senator Mikulski’s legacy of women leadership in Maryland. She will fight to create well-paying middle class jobs, get guns out of the hands of domestic abusers, address income inequality, provide debt-free college, and make critical investments in education for our students.",
      "Website:" : "https://donnaedwardsforsenate.com/"
    },
    "Tom Fiegen" :     {
      "Candidate:" : "Tom Fiegen",
      "State:" : "Iowa",
      "Party:" : "Democrat",
      "Credentials/Platform:" : "My parents were farm activists from the 1960s forward. They were members of the NFO (National Farmers Organization) and Farmers Union. They started taking me along to farm organization meetings when I was in 6th grade. My mother is also one of the original McGovern Democrats. They agreed with George McGovern on food and hunger issues, on family farm agriculture and on peace. My parents received a “drop dead” letter from their bank on December 15, 1984. It gave them sixty (60) days to pay back all of their farm loans, including the mortgage. They were paying 23% interest at the time. Plus the bank froze their checking account and would not release any money to buy feed for the livestock, fuel for the tractors, or even to pay the electricity bill. I worked with my parents to save their farm, and began volunteering at one of the first Farm Aid clinics, located in Hills, Iowa. That lead me to a career as an ag law and bankruptcy attorney for the last 27 years. I have always been an advocate for small farmers and business owners. My parents saved their farm and retired last year. They still live on the family farm. In my precinct in Clarence, I have been the caucus chair since 1992. In 2000, Governor Tom Vilsack called me to ask me to run against an 18 year Republican State Senate incumbent, Jack Rife. After thinking about it, I agreed. My family and I knocked on over 14,000 doors and I beat Jack Rife. I was the only Democrat to beat a Republican incumbent in Iowa State Senate races in 2000.",
      "Website:" : "http://fiegenforussenate.com/"
    },
    "Cori Bush" :     {
      "Candidate:" : "Cori Bush",
      "State:" : "Missouri",
      "Party:" : "Democrat",
      "Credentials/Platform:" : "Born and raised in the St. Louis Missouri area, Cori is an ordained pastor, an activist & organizer with Ferguson Frontline, co-director of the Truth Telling Project, an international presenter on nonviolent conflict, and a Nonviolence 365 Ambassador with The King Center. She is the host of her own internet radio show entitled, ‘ground.ed’ on BlogTalkRadio produced by Tribe Family Channel and Gumbo for the Soul. She is a recipient of the 2015 Woman of Courage Award from the Emmett Till Legacy Foundation, the daughter of a politician father and a computer analyst mother. Cori is the proud parent of two amazing teenagers and the sibling of two. She is also a registered nurse, supervising nursing services for several mental health facilities in St. Louis city that serve the homeless, underserved, underinsured, and uninsured. Cori has been on the frontlines of the Ferguson movement as a protester, as clergy, as a medic and as a victim of police assault on the day of the announcement not to indict Darren Wilson. She has been interviewed numerous times by several local, national, and international media outlets. Cori plans to continue to stand alongside the youth of today in the fight for justice and equality for all.",
      "Website:" : "http://coribush.com/"
    },
    "John Fetterman" :     {
      "Candidate:" : "John Fetterman",
      "State:" : "Pennsylvania",
      "Party:" : "Democrat",
      "Credentials/Platform:" : "Pennsylvania born and raised, John was born to teenage parents who were just starting out on their own. At the time, his father worked nights to put himself through college. John grew up in York, and later followed in his father’s footsteps to Albright College, where he played offensive tackle for the Lions. At 23, John joined up with Big Brothers/Big Sisters, and his life has never been the same since. John threw himself into the program, mentoring his ‘little’ - an 8 year-old boy who had recently lost his father to AIDS and whose mother was also battling the disease. Before she passed away, John promised that he would continue to look out for her son and make sure that he would graduate college. Fifteen years later, John’s and his ‘little’ had both held up their ends of the bargain, with his little’s graduation from Washington and Jefferson College in Washington, PA. But John wanted to do more. The disparity between his own life and that of his ‘little’ motivated him to quit his job and join AmeriCorps’ 2nd Year class. For two years, John served in Pittsburgh’s historic Hill District, where he helped set up the first computer labs in the neighborhood and taught GED classes to young mothers and fathers. He went on to earn a Masters in Public Policy from Harvard’s Kennedy School of Government where he focused on finding solutions in social work, business, and public policy to confront urban challenges and economic inequality. John then returned to Pennsylvania to start a GED program in the town of Braddock. Once a booming steel town where Andrew Carnegie established his first mill, Braddock in 2001 was one of the poorest and most troubled communities in the commonwealth, facing steep population decline and high rates of poverty. John saw the town’s beauty and the grit and determination that had been the community’s roots for generations. He bought an abandoned church and made Braddock home. In 2005, encouraged by his students and motivated to do more to address the inequality that he felt was holding Braddock back, John ran for mayor. He managed to win the crowded primary by a single vote. And he’s been hard at work ever since. During the last 10 years as mayor, John is most gratified by breaking the cycle of violence in Braddock that culminated with nearly 5 ½ years without the taking of a life. He’s applied a hands-on approach from AmeriCorps and his service experience with to take steps towards progress and rebuild this community, creating jobs, getting youth engaged, and bringing creative urban policy solutions to Braddock. John’s made a pitch to young people and artists to transform creative spaces downtown and he’s worked to recruit new residents and businesses. Braddock now has a community center, urban gardens, and a free store run by John’s wife, Gisele. When Pennsylvania lawmakers continued to push outdated discriminatory policies banning marriage equality, Mayor John stood up and officiated one of the first same-sex marriages in the commonwealth. He’s encouraged clean energy policies to create new jobs and put folks in Braddock back to work. Mayor John was re-elected in 2009 by a 2-1 margin, and again in 2013 by an 8-1 margin, and now serves in his 3rd term as mayor. John, his wife Gisele, and their three children Karl, 6, Gracie 4, and August, 18 months, live in a restored car dealership in Braddock with the family bulldog, Dave.",
      "Website:" : "https://johnfetterman.com/"
    },
    "Steve Stokes" :     {
      "Candidate:" : "Steve Stokes",
      "State:" : "California",
      "Party:" : "Democrat",
      "Credentials/Platform:" : "Although I have been a longtime activist for non-partisan politics and independent candidates, I am joining Senator Bernie Sanders as a Democrat, determined to restore democratic principles and processes to the Democratic Party and to our Nation. Our battle is #WeThePeople vs The Corrupt Corporate State. We must awaken the urgency of this moment in all minds. This is not an ordinary election, an ordinary candidate, or an ordinary time in our country's history. The freedoms and founding principles of our great nation have been abandoned by our short-sighted, self-interested leaders, who have been corrupted by the influence of money and multi-national corporations who care not about freedom but about profit. Great concentrations of wealth have corrupted both parties which purport to speak for the American people. #WeThePeople demand our country back. This chain of corruption has created a litany of problems and injustices in America. Our bright future demands that we undergo mass changes and reform of our democracy to return to government of the people, by the people and for the people. I am the only candidates in my race that endorses Senator Bernie Sanders (endorsed on 4/28/2015), the only major candidate that publicly denounces and actively fights to defeat the Trans-Pacific Partnership, the only candidate that strongly opposes the #CISA which passed in the recent omnibus bill, and the only grassroots independent Democrat running to reform the Democratic Party.",
      "Website:" : "http://www.stokes4congress.com/"
    },
    "Suan Guthrie" :     {
      "Candidate:" : "Suan Guthrie",
      "State:" : "Florida",
      "Party:" : "Democrat",
      "Credentials/Platform:" : "",
      "Website:" : ""
    },
    "Kevin Stine" :     {
      "Candidate:" : "Kevin Stine",
      "State:" : "Oregon",
      "Party:" : "Democrat",
      "Credentials/Platform:" : "I was born in Medford, Oregon in 1985 to a single mother. We lived in Oregon until I was 10 and then lived in a small town in Oklahoma where I experienced the country lifestyle. During my Senior year in high school, I decided that I would take the opportunity to serve in the military. The ability to view the world was enticing to me, as well as the ability to break the cycle of poverty that family has been in. I served in the United States Navy on-board submarines as an Electronics Technician, with a specialty in radio communications. I was stationed on the USS Hyman G Rickover and the USS Pittsburgh. I completed three deployments in my nine years of service. After being honorably discharged, I returned home to Medford with my wonderful wife of nine years, Casey, and my daughter Riley. Wanting to be involved in politics, I contacted the Jackson County Democrats and went to the Medford City Council meetings. When I saw an opportunity to step into public service once again, this time as an elected official, I took it and won election to the Medford City Council. Now, I see an opening in the United States Senate. The current holder of the seat, Ron Wyden, has put corporate interests ahead of Oregon interests. This needs to change, and I need your support in helping this happen.",
      "Website:" : "www.kevinstine.com"
    },
    "Kelli Prather" :     {
      "Candidate:" : "Kelli Prather",
      "State:" : "Ohio",
      "Party:" : "Democrat",
      "Credentials/Platform:" : "Throughout my life, I have worked as an active, political voice for underserved communities in Cincinnati and New York City. I have led various projects for the improvement, enrichment, and beautification of Ohio. I successfully established several minority-owned and operated businesses in Cincinnati. I was born in Cincinnati, Ohio and I am a product of the Cincinnati Public School system. I love my city, my state and my nation and decided it was time to do more to serve my local and national community. As a member of the Democratic Party, I would be honored to have the chance to enhance the quality of life of Ohioans through improved healthcare, education, and community safety as a United States Senator. I believe in building a healthy community one individual at a time. I plan to expand on the Affordable Care Act to ensure that Ohio residents have timely access to care they can afford. Healthcare should be patient-driven, not carrier-driven. Every person should have choice when it comes to his or her care. Additionally, every child should have access to quality, government provided pre-school for at least two years before kindergarten. In order to address the issues of childhood poverty and lackluster performance in school we need to ensure every child in Ohio has the opportunity to succeed and I believe quality pre-school can help start each child on the path to success. As a U.S. Senator, I fully intend to pioneer projects geared toward combating socioeconomic disparities and problems which contribute to highly publicized safety problems within our communities. I firmly believe that fear and distrust should not cripple our ability to work together to improve the lives of all Ohioans regardless of neighborhood, race, or socioeconomic level. I will dutifully serve Ohio and our Nation as a U.S. Senator. I have been a strong voice in advocating for civil rights and social justice. I am a member of the NAACP and a supporter of the Urban League of Greater Cincinnati, the Alzheimer's Association, the Susan B. Koman Breast Cancer Awareness Center, and I am the Chair of the Cincinnati Black Teen Ambassadors. After earning a Master’s Degree in Occupational Therapy, I formed several companies providing skilled occupational therapy services in a variety of settings primarily home health. These endeavors allowed me to merge the clinical and business aspects of healthcare. I have extensive and diversified knowledge and experience in healthcare policies and procedures that govern healthcare reimbursement. I firmly believe that integrity is the cornerstone of character and my focus on equality in healthcare, issues of social justice, and education make me an excellent candidate. I am Kelli Prather and I want to be every Ohioan’s U.S. Senator.",
      "Website:" : "http://www.kelliforussenate2016.com/"
    },
    "Lennie Clark" :     {
      "Candidate:" : "Lennie Clark",
      "State:" : "Arizona",
      "Party:" : "Democrat",
      "Credentials/Platform:" : "My name is Leonard Clark, but you can call me Lennie. I'm a Progressive activist and music teacher, and I'm an Army/Arizona National Guard veteran. I've been running for Congress a few times as a Democrat in my heavily-Republican district, but I've decided to run for the U.S. Senate seat held by John McCain -- a state-wide race -- because there is a Progressive groundswell that is sweeping the nation. Arizonans need a true Progressive candidate in the race, and I'm proud to endorse Bernie Sanders for President of the United States of America! NOW IS THE TIME to take this bold new Progressive Revolution to the voters of Arizona and elect a true Progressive to the U.S. Senate. One who will stand with Bernie and his policies when he wins the election. I don't have a Super PAC and I'm not taking corporate money, so we'll be outspent. I'm not part of the establishment, so we'll be ridiculed by the political class. I'm running a campaign to unite what I believe is a Progressive majority in Arizona. Lots of people will tell us that what we're trying to do is impossible, but they are wrong. There is a real Progressive hunger in this country, including Arizona, and with that fire behind us, we have a real chance! I hope you'll support my candidacy for U.S. Senate. We have an uphill battle ahead, but we can be victorious with YOUR support!",
      "Website:" : "www.lennie2016.com/"
    }
  },
  "Governor" : {
    "Matt Dunne" :     {
      "Candidate:" : "Matt Dunne",
      "State:" : "Vermont",
      "Party:" : "",
      "Credential/Platform:" : "Matt and his wife Sarah are raising their kids, Judson, Abe, and Cora, in the Hartland farmhouse where Matt grew up. Matt knows first hand how truly special Vermont communities are. When Matt’s father passed away when he was 13, the Hartland community rallied around his family, providing emotional support, helping with everyday chores and cooking, and assisting Matt as he took over the family finances. At twenty-two, Matt was elected to the Vermont House of Representatives where he was known for working across the aisle to get things done. Matt sponsored legislation that helped pave the way for Vermont’s craft beer boom, wrote the first legislation dedicated to the redevelopment of downtowns, created the Vermont Film Commission, and wrote the Land Recycling Act -- the first legislation to encourage redevelopment of abandoned industrial sites. In the legislature he earned the respect of his peers where they elected him to serve as House Majority Whip. Matt was recognized for this work with a leadership role in the National Conference of State Legislatures’ Economic Development Committee. He received a Arthur Flemming Fellowship and won awards from state and national veterans organizations. When serving in the Vermont Senate Matt was a member of the Institutions and Appropriations Committees where he developed critical parts of the state budget, and spearheaded the creation of a standing Economic Development Committee with Senator Hinda Miller, focusing on economic development strategies and encouraging entrepreneurship in Vermont. As senator Matt served as Chair of the Vermont delegation to the New England Board of Higher Education and led the effort to give Veteran’s preference for state jobs. Beyond his experience in state government, Matt has helped businesses of all types succeed and thrive. Matt helped grow the Vermont software company, Logic Associates, to over 100 people. Bill Clinton then appointed Matt to run AmeriCorps*VISTA, an organization of 6,000 people, where he helped low-income people successfully start their own businesses and empower themselves out of poverty. For the last eight years, Matt worked for Google, where he created a community affairs program for the company from scratch. Leading his team out of an old bread factory in White River Jct., Matt worked with state and local governments to facilitate billions of dollars of infrastructure investment around the world. He led initiatives that brought high-speed internet to rural and urban communities, facilitated hundreds of millions of dollars in affordable housing programs, brought thousands of small businesses online, and created a program to teach low-income girls how to code. Throughout his life Matt has remained passionately connected to Vermont communities. Matt has served on the boards of nonprofits including the Vermont Arts Council, Windsor County Court Diversion, the New England Board of Higher Education, the Vermont Infrastructure Bank, the Vermont Film Commission, and Dartmouth Hitchcock Medical Center. In the aftermath of Hurricane Irene, Matt partnered with the Agency of Transportation and Green Mountain Power to create the Irene Crisis Map, which gave everyone in the state access to real-time information on road closings, power outages, and relief resources. He also helped launch the Glory Days of the Railroad festival, was instrumental in bringing Northern Stage and the Center for Cartoon Studies to downtown White River Jct. and has led the effort to raise money to rebuild the historic barns at the Lemax dairy farm in North Hartland. To see how Matt will use his experience, leadership, and community values to create an economy that works for all Vermonters and all of Vermont, check out his issues page here.",
      "Website:" : "http://www.mattdunne.com/"
    },
    "Heather Mizeur" :     {
      "Candidate:" : "Heather Mizeur",
      "State:" : "Maryland",
      "Party:" : "",
      "Credential/Platform:" : "",
      "Website:" : ""
    }
  },
  "State Legislature" : {
  },
  "Local" : {
  }
}
